//****************************************************************************************************
Процедура Отправить(Настройки, КаталогНаFTP, ФайлНаКомпьютере, ФайлНаFTP)
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	
	FTPСоединение = Новый FTPСоединение(НастройкиОбмена.АдресFTP, НастройкиОбмена.Порт, НастройкиОбмена.Логин, НастройкиОбмена.Пароль);
	
	FTPСоединение.УстановитьТекущийКаталог("/");
	
	FTPСоединение.Записать(ФайлНаКомпьютере, ФайлНаFTP);
	
КонецПроцедуры
//****************************************************************************************************
Процедура Скачать(НастройкиОбмена) Экспорт 

	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	
	FTPСоединение = Новый FTPСоединение(НастройкиОбмена.АдресFTP, НастройкиОбмена.Порт, НастройкиОбмена.Логин, НастройкиОбмена.Пароль);
	
	FTPСоединение.УстановитьТекущийКаталог("/");
	
	НайденныеФайлы = FTPСоединение.НайтиФайлы("/", "*.*");
	
	Для А = 0 По НайденныеФайлы.Количество() - 1 Цикл 
		
		Если НайденныеФайлы[А].ЭтоКаталог() Тогда 
			
			Продолжить;
			
		КонецЕсли;
	
		FTPСоединение.Получить(НайденныеФайлы[А].ПолноеИмя, НастройкиОбмена.ПутьККаталогуЗагрузкиФайлов + "\" + НайденныеФайлы[А].Имя);
		
		FTPСоединение.Удалить(НайденныеФайлы[А].ПолноеИмя);

	КонецЦикла;

КонецПроцедуры
//****************************************************************************************************