#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций  

Функция СпособЗаполненияПоУмолчанию(ТипЭталона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СпособыПодбораЭталонов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СпособыПодбораЭталонов КАК СпособыПодбораЭталонов
		|ГДЕ
		|	СпособыПодбораЭталонов.ПоУмолчанию
		|	И СпособыПодбораЭталонов.ТипЭталона = &ТипЭталона";
	
	Запрос.УстановитьПараметр("ТипЭталона", ТипЭталона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.СпособыПодбораЭталонов.ПустаяСсылка();
	КонецЕсли;

	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти