
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		возврат;
	КонецЕсли;	
	
		Если ЗначениеЗаполнено(ТипЭталона) Тогда
		СтрокиОсновногоПредставления = ЭтотОбъект.СтруктураПолей.НайтиСтроки(Новый Структура("ОсновноеПредставление", Истина));
		Если СтрокиОсновногоПредставления.Количество() = 0 Тогда
			Сообщить("Не задано основное представление для объектов"); 
			Отказ = Истина;             
		ИначеЕсли СтрокиОсновногоПредставления.Количество() > 1 Тогда
			Сообщить("Поле основного представления может быть только одно!"); 
			Отказ = Истина;	
		Иначе
			Если Не ЗначениеЗаполнено(СтрокиОсновногоПредставления[0].ИмяПоля) Тогда
				Сообщить("Основному представлению не назначено поле запроса!"); 
				Отказ = Истина;
			КонецЕсли;  		
		КонецЕсли; 
		
		СтрокиПоиска = ЭтотОбъект.СтруктураПолей.НайтиСтроки(Новый Структура("Поиск", Истина));
		
		Если СтрокиПоиска.Количество() > 0 Тогда
			
			Для каждого СтрокаПоиска из СтрокиПоиска Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаПоиска.РеквизитЭталона) Тогда
					Сообщить("Для поля поиска не указан реквизит эталона");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого Правило из ЭтотОбъект.ПравилаУстановкиЗначений Цикл
			
			Если Правило.ВидСравнения = Перечисления.ВидыСравнения.Содержит или Правило.ВидСравнения = Перечисления.ВидыСравнения.НачинаетсяС Тогда
				
				Если ТипЗнч(Правило.Значение) <> Тип("Строка") Тогда
					Сообщить("Для указанного в строке №" + Правило.НомерСтроки + " правила тип значения может быть только строкой");
					Отказ = Истина;	
				КОнецЕсли;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		ТЗ = ЭтотОбъект.ПравилаУстановкиЗначений.Выгрузить(,"ГруппаПравил");
		ТЗ.Свернуть("ГруппаПравил");                            
		
		Если ЭтотОбъект.ПравилаУстановкиЗначений.Найти(Справочники.ЗначенияЭталонов.ПустаяСсылка(), "ЗначениеЭталона") <> Неопределено Тогда
			Сообщить("Существуют правила для определения эталона с пустым значением эталонного справочника");  
			Отказ = Истина;  	
		КонецЕсли;

		
		Для каждого СтрокаТЗ из ТЗ Цикл
			
			ТЗГруппы = ЭтотОбъект.ПравилаУстановкиЗначений.Выгрузить(Новый Структура("ГруппаПравил", СтрокаТЗ.ГруппаПравил), "ЗначениеЭталона"); 
			ТЗГруппы.Свернуть("ЗначениеЭталона");
			Если ТЗГруппы.Количество() <> 1 Тогда
				Сообщить("Группа правил должна содержать ссылку на одно и то же значение эталонного справочника");
				Отказ = Истина;
			КонецЕсли;         
			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПоУмолчанию и ЗначениеЗаполнено(ТипЭталона) Тогда
		
		 Запрос = Новый Запрос;
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	СпособыПодбораЭталонов.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.СпособыПодбораЭталонов КАК СпособыПодбораЭталонов
		                |ГДЕ
		                |	СпособыПодбораЭталонов.Ссылка <> &Ссылка
		                |	И СпособыПодбораЭталонов.ПоУмолчанию
		                |	И СпособыПодбораЭталонов.ТипЭталона = &ТипЭталона";
		 
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("ТипЭталона", ТипЭталона);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не Результат.Пустой() Тогда
			 
			 Сообщить("Для данного типа эталонных справочников уже задан способ подбора данных по умолчанию");
			 Отказ = Истина;
			 
		 КонецЕсли;
		
	 КонецЕсли;	 

КонецПроцедуры
#КонецОбласти
