
&НаСервере
Функция ПолучитьБазыПоОбъекту(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыКВыгрузкеТипыБазы.ТипБазы КАК ТипБазы
	               |ПОМЕСТИТЬ ВтТипы
	               |ИЗ
	               |	Справочник.ОбъектыКВыгрузке.ТипыБазы КАК ОбъектыКВыгрузкеТипыБазы
	               |ГДЕ
	               |	ОбъектыКВыгрузкеТипыБазы.Ссылка = &Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Базы.Ссылка КАК База
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.ТипБазы В
	               |			(ВЫБРАТЬ
	               |				ВтТипы.ТипБазы
	               |			ИЗ
	               |				ВтТипы)";
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура УстановитьНаСервере()
	
	Если Объекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Базы.Количество() = 0 Тогда
		ПоВсем = Истина;
	Иначе
		ПоВсем = Ложь;
	КонецЕсли;
		
	Для Каждого Строка Из Объекты Цикл
		СписокБаз = ПолучитьБазыПоОбъекту(Строка.Значение);
		Если СписокБаз.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаБаза Из СписокБаз Цикл
			Если НЕ ПоВсем Тогда
				Если Базы.НайтиПоЗначению(СтрокаБаза.База) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Менеджер = РегистрыСведений.ЗаданияНаПовторнуюВыгрузку.СоздатьМенеджерЗаписи();
			Менеджер.БазаДанных = СтрокаБаза.База;
			Менеджер.ОбъектКВыгрузке = Строка.Значение;
			Менеджер.НеОчищать = НеОчищать;
			Менеджер.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьНаСервере();
	
КонецПроцедуры
