
&НаКлиенте
Процедура ПереместитьВверх(Команда)
	ИзменитьКодЭлемента(-1);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	ИзменитьКодЭлемента(1);
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьКодЭлемента(Направление)
	
	СортировкаПоКоду = Истина;
	
	Если Список.Порядок.Элементы.Количество() = 0 Тогда
		СортировкаПоКоду = Ложь;
	ИначеЕсли Список.Порядок.Элементы.Получить(0).Поле <> Новый ПолеКомпоновкиДанных("Код") Тогда
		СортировкаПоКоду = Ложь;
	КонецЕсли;
	
	Если Не СортировкаПоКоду Тогда
		//Предупреждение("Для изменения порядка следования
		//|необходимо установить сортировку по коду.");
		//
		//Если Вопрос("Установить сортировку по коду?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
		//	Порядок.Установить("Код");
		//КонецЕсли;
		//
		//Возврат; 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("Для изменения порядка следования
		|необходимо установить сортировку по коду. Установить сортировку по коду?"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			УстановитьПорядокПоКоду();
		КонецЕсли;	
		
		Возврат;
		
	КонецЕсли;
	
	НаправлСорт = Список.Порядок.Элементы.Получить(0).ТипУпорядочивания;
	
	Если НаправлСорт = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда
		Направление = Направление * (-1);
	КонецЕсли;
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда 
		ИзменитьКод(Направление);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры // ИзменитьКодЭлемента()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПорядокПоКоду();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядокПоКоду()
	Список.Порядок.Элементы.Очистить();
	
	НовыйПорядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	
	//Если необходимо по возрастанию сортировать то меняем на Убыв на Возр
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	//Дата регистрации мой реквизит, здесь заменить на Ваш реквизит сортировки
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Код");
	
	
	НовыйПорядок.Использование = Истина;
	
КонецПроцедуры	  

Процедура ИзменитьКод(Направление)
	ТекОбъект =  Элементы.Список.ТекущаяСтрока.ПолучитьОбъект();
	ТекОбъект.ИзменитьКод(Направление);
КонецПроцедуры	

