  #Область ПрограмныйИнтерфейс
  Функция ПолучитьБазуПоОрганизации(Организация) Экспорт
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	БазыОрганизации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Базы.Организации КАК БазыОрганизации
		|ГДЕ
		|	БазыОрганизации.Организация = &Организация
		|	И НЕ БазыОрганизации.Ссылка.Отключена";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		
		 Возврат Справочники.Базы.ПустаяСсылка();
		
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	  
 КонецФункции
  
  
  #КонецОбласти