
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовФормы()
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()

	Элементы.Использование.Видимость = Объект.Тип = Перечисления.ТипыОбъектов.Справочник
												ИЛИ Объект.Тип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик;
	Элементы.Индексирование.Видимость = (Объект.Вид = Перечисления.ВидыСвойств.Реквизит 
											И ЗначениеЗаполнено(Объект.Родитель) 
											И ((Объект.Родитель.Тип = Перечисления.ТипыОбъектов.Справочник ИЛИ Объект.Родитель.Тип = Перечисления.ТипыОбъектов.Документ)
												ИЛИ (ЗначениеЗаполнено(Объект.Родитель.Родитель) И Объект.Родитель.Родитель.Тип = Перечисления.ТипыОбъектов.Документ И Объект.Родитель.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть)))
												ИЛИ Объект.Вид = Перечисления.ВидыСвойств.Измерение

КонецПроцедуры
