//*********************************************************************************************************
&НаКлиенте
Процедура ПутьККаталогуХраненияФайловОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборКаталога(Объект.ПутьККаталогуХраненияФайловОбмена);
	
КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура ПутьККаталогуЗагрузкиФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборКаталога(Объект.ПутьККаталогуЗагрузкиФайлов);
	
КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура ПутьККаталогуАрхиваНачалоВыбора (Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборКаталога(Объект.ПутьККаталогуАрхива);
	
КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура ВыборКаталога(ТекущийОбъект)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);

	ДиалогОткрытияФайла.Заголовок			 = "Выберите каталог";
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда

		ТекущийОбъект = ДиалогОткрытияФайла.Каталог;

	КонецЕсли;

КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура bcpSQLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогОткрытияФайла.Фильтр				 = НСтр("ru = 'Приложение'; en = 'Application'") + "(*.exe)|*.exe";
	ДиалогОткрытияФайла.Заголовок			 = "Выберите приложение bcp";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = "";
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Объект.bcpSQL = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
	КонецЕсли;	

КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура КаталогОшибокSQLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогОткрытияФайла.Заголовок			 = "Выберите каталог";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = "";
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Объект.КаталогОшибокSQL = ДиалогОткрытияФайла.Каталог;
		
	КонецЕсли;
	
КонецПроцедуры
//*********************************************************************************************************
&НаКлиенте
Процедура ПутьККаталогуОтчётовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборКаталога(Объект.ПутьККаталогуОтчётов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементов()
	
	Если Объект.ЗагрузкаИзFTP Тогда
		Элементы.Группа2.ТолькоПросмотр = Ложь;
		Элементы.Группа4.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Группа2.ТолькоПросмотр = Истина;
		Элементы.Группа4.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзFTPПриИзменении(Элемент)
	
	ОбновитьДоступностьЭлементов();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры
//*********************************************************************************************************