
&НаСервереБезКонтекста
Процедура СписокОранизацийПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БазыОрганизации.Организация КАК Организация,
		|	БазыОрганизации.Ссылка.Наименование КАК Базы
		|ИЗ
		|	Справочник.Базы.Организации КАК БазыОрганизации
		|ГДЕ
		|	БазыОрганизации.Организация В(&Организация)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация";
	Запрос.УстановитьПараметр("Организация",Строки.ПолучитьКлючи());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		  СтрокаСписка = Строки[Выборка.Организация];
		  СтрокаСписка.Данные.СписокБаз = СтрокаСписка.Данные.СписокБаз+?(СтрокаСписка.Данные.СписокБаз="", "", ", ")+Выборка.Базы;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БлокируемыеПоля=Новый Массив;
	БлокируемыеПоля.Добавить("СписокБаз");
	СписокОрганизаций.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
	СписокОрганизаций.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
	СписокОрганизаций.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля);
КонецПроцедуры
