
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектЗапись = РеквизитФормыВЗначение("Запись");
    ОбъектИтерации = ОбъектЗапись.Данные.Получить();
	
	Попытка
		ПредставлениеПериода = ПредставлениеПериода(Дата(ОбъектЗапись.ДатаНачалаСтрокой), Дата(ОбъектЗапись.ДатаОкончанияСтрокой));
		тдДанныеПериода = Обработки.КонтрольДанныхОСВ.ПечатьСКД(Новый Структура("тзДанные, ПредставлениеПериода", ОбъектИтерации, ПредставлениеПериода));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;		
	
КонецПроцедуры
