

#Область ОбработчикиСобытийФормы
// Код процедур и функций   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	
	
	
	Если ТекущийОбъект.ЕстьТаблицаИтогов Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗ.ИмяПоля КАК ИмяПоля,
		|	ТЗ.ИтогиРесурс КАК ИтогиРесурс,
		|	ТЗ.ТипПоля КАК ТипПоля
		|ПОМЕСТИТЬ ВТСтруктура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтруктура.ИмяПоля КАК ИмяПоля,
		|	ВТСтруктура.ИтогиРесурс КАК ИтогиРесурс,
		|	ТипыПолейSQL.ИмяТипаSQL КАК ТипПоля
		|ИЗ
		|	ВТСтруктура КАК ВТСтруктура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыПолейSQL КАК ТипыПолейSQL
		|		ПО ВТСтруктура.ТипПоля = ТипыПолейSQL.Ссылка";
		
		
		
		Запрос.УстановитьПараметр("ТЗ", ТекущийОбъект.СтруктураТаблицыSQL.Выгрузить(, "ИмяПоля, ИтогиРесурс, ТипПоля"));
		
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			Отказ = Истина;
			
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена структура данных. Формирование таблицы итогов не возможно.";
			Сообщение.Поле = "Объект.ЕстьТаблицаИтогов";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		Иначе
			СтруктураДляПроверки = Результат.Выгрузить();
			
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИтогиРесурс", Истина);
			
			Ресурсы = СтруктураДляПроверки.НайтиСтроки(Отбор);
			
			Если Ресурсы.Количество() = 0 Тогда
				
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для формирования таблицы итогов должен быть отмечен хотя бы один ресурс.";
				Сообщение.Сообщить();
				
			Иначе
				
				Для Каждого Ресурс из Ресурсы Цикл
					
					Если СтрНайти(Ресурс.ТипПоля, "decimal") = 0 И СтрНайти(Ресурс.ТипПоля, "integer") = 0 Тогда
						
						Отказ = Истина;
						Сообщение = Новый СообщениеПользователю; 
						Сообщение.Поле = "Объект.СтруктураТаблицыSQL["+Строка(СтруктураДляПроверки.Индекс(Ресурс) - 1) + "].ТипПоляSQL"; 
						Сообщение.Текст = "Ресурс должен иметь числовое значение!";
						Сообщение.Сообщить();
						
					КонецЕсли;
					
				КонецЦикла;
						
			КонецЕсли;   
			
			
			Если СтруктураДляПроверки.Найти("ВидДвижения", "ИмяПоля") = Неопределено Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле = "Объект.ЕстьТаблицаИтогов";
				Сообщение.Текст = "Отсутствует поле ""ВидДвижения"". Построение таблицы итогов не возможно.";
				Сообщение.Сообщить();
				
				
			КонецЕсли;
			
			//Проверить наличие периода
			
			//Проверить наличие вида движения
			
			
		КонецЕсли;
		
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций 

&НаКлиенте
Процедура ЕстьТаблицаИтоговПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
// Код процедур и функций  
&НаКлиенте
Процедура ЗаполнитьИзМакета(Команда)
	
	СписокМакетов = ЗаполнитьСписокМакетов();
	
	Если СписокМакетов.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗавершениеВыбора", ЭтотОбъект);
		
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокМакетов, Элементы.СтруктураТаблицыSQL);
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций 

&НаСервере
Процедура ЗаполнитьИзМакетаНаСервере()
	ЗаполнитьСписокМакетов();
КонецПроцедуры


&НаСервере
Функция ЗаполнитьСписокМакетов()
	
	СписокМакетов = Новый СписокЗначений;
	
	Для каждого Макет из Метаданные.Справочники.СтруктураТаблицSQL.Макеты Цикл
		
		СписокМакетов.Добавить(Макет.Имя, Макет.Синоним);
		
	КонецЦикла;	         
	
	Возврат СписокМакетов; 	
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьЗавершениеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ЗаполнитьСтруктуру(ВыбранныйЭлемент.Значение);
		
	КонецЕсли;
	
КонецПроцедуры	 

&НаСервере 
Процедура ЗаполнитьСтруктуру(Макет)
	
	
	Макет = Справочники.СтруктураТаблицSQL.ПолучитьМакет(Макет);
	
	Объект.СтруктураТаблицыSQL.Очистить();
	
	Ряд = 1;
	Обл = Макет.Область("R"+Ряд+"C1");
	Пока Не ПустаяСтрока(Обл.Текст) Цикл
		
		НоваяСтрока = Объект.СтруктураТаблицыSQL.Добавить();
		НоваяСтрока.ИмяПоля = Обл.Текст;
		Ряд = Ряд+1;
		Обл = Макет.Область("R"+Ряд+"C1");
	КонецЦикла;	
	
	
	
КонецПроцедуры

//++ 30.11.2024 Корыткин 
&НаСервере 
Процедура УстановитьВидимость()
	
	Элементы.СтруктураТаблицыSQLИтогиИзмерение.Видимость = Объект.ЕстьТаблицаИтогов;
	Элементы.СтруктураТаблицыSQLИтогиРесурс.Видимость = Объект.ЕстьТаблицаИтогов;
	
	
КонецПроцедуры	

//-- 30.11.2024


#КонецОбласти