
Процедура ВыполнитьСценарий(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.ПроцедураSQL КАК ПроцедураSQL
		|ИЗ
		|	Справочник.СценарииВыполненияПроцедурSQL.ПроцедурыSQL КАК СценарииВыполненияПроцедурSQLПроцедурыSQL
		|ГДЕ
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.Ссылка = &Ссылка
		|	И СценарииВыполненияПроцедурSQLПроцедурыSQL.Активна
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.НомерСтроки";   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Справочники.ПроцедурыSQL.ВыполнитьПроцедуруSQL(Выборка.ПроцедураSQL) Тогда
			ВызватьИсключение "Ошибка выполнения сценария";  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры