
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Модифицированность = Ложь;
	Закрыть();
		
	ВидРеквизита = ПолучитьПрефиксФормы();
	
	Если НЕ ПустаяСтрока(ВидРеквизита) Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ", Объект.Ссылка);
		
		ОткрытьФорму("Справочник.СтруктураМетаданных.Форма.Форма" + ВидРеквизита, СтруктураПараметров, ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПрефиксФормы() 
	
	ПредставлениеВидаРеквизита = "РеквизитаМетаданных";
	
	Родитель = Объект.Родитель;
	Если ЗначениеЗаполнено(Родитель) Тогда
		
		Если Родитель.Тип = Перечисления.ТипыОбъектов.Перечисление Тогда 
			ПредставлениеВидаРеквизита = "ПредопределенногоРеквизита";  
		//ИначеЕсли Родитель.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть Тогда 
		//	ПредставлениеВидаРеквизита = "СтандартногоРеквизита";
		КонецЕсли;
		
	КонецЕсли;   
	
	Возврат ПредставлениеВидаРеквизита
	
КонецФункции

