
&НаСервере
Процедура СформироватьНаСервере()
	ТЗ = Выборка();
	Если ТЗ.Количество()=0 Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;	
	ИтогоТЗ = ТЗ.Скопировать();
	ИтогоТЗ.Свернуть("Account","AmountDt,AmountKt");
	
	
	отОб = РеквизитФормыВЗначение("Отчет");
	Макет = отОб.ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Период = "Отчет с "+Формат(ВыборПериода.ДатаНачала,"ДЛФ=DD")+" по "+Формат(КонецДня(ВыборПериода.ДатаОкончания),"ДЛФ=DD");
	Шапка.Параметры.Организация = Организация;
	
	
	ТаблДокумент = Результат;
	ТаблДокумент.Очистить();
	
	ТаблДокумент.Вывести(Шапка);
	
	ОблСчетИтого 	= Макет.ПолучитьОбласть("СчетИтого");
	ОблСтрока 		= Макет.ПолучитьОбласть("Строка");
	
	
	ТекСчет = Неопределено;
	Для Каждого Стр Из ТЗ Цикл 
		
		Если ТекСчет <> Стр.Account Тогда
			
			ОблСчетИтого.Параметры.Account = Стр.Account;
			Найденнаястрока = ИтогоТЗ.найти(Стр.Account,"Account");
			Если Найденнаястрока<>Неопределено тогда
				ОблСчетИтого.Параметры.AmountDt = Найденнаястрока.AmountDt;
				ОблСчетИтого.Параметры.AmountKt = Найденнаястрока.AmountKt;
			КонецЕсли;	
			ТаблДокумент.Вывести(ОблСчетИтого);
			ТекСчет = Стр.Account;
		КонецЕсли;
		
		//выведим общий итог
		ОблСтрока.Параметры.Заполнить(Стр);
		ТаблДокумент.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОбластьПодвал.Параметры.Руководитель = Руководитель;
	
	//ТаблДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

//********************************************************************************************************

Функция Выборка() Экспорт
	Таблица = Новый ТаблицаЗначений;
	
	Команда = ПолучениеОтчетов.Соединение();

	Попытка
		
		Param1 = Команда.CreateParameter(,8,1,,Формат(ВыборПериода.ДатаНачала,"ДФ=гггг.ММ.дд"));
		Команда.Parameters.Append(Param1);
		
		Param2 = Команда.CreateParameter(,8,1,,Формат(ВыборПериода.ДатаОкончания,"ДФ=гггг.ММ.дд"));
		Команда.Parameters.Append(Param2);
		
		Param3 = Команда.CreateParameter(,200,1,12,Организация.БИН);
		Команда.Parameters.Append(Param3);
		
		Команда.CommandText = ПолучениеОтчетов.ЗапросАнализСчетов();
		
		Выборка = Команда.Execute();
		
		Если НЕ Выборка.BOF Тогда

			Для А = 0 По Выборка.Fields.Count - 1 Цикл
				
				ИмяСтолбца = Выборка.Fields.Item(А).Name;  
				
				Таблица.Колонки.Добавить(ИмяСтолбца);

			КонецЦикла;
			
			//Выборка.MoveFirst();
			
			Пока НЕ Выборка.EOF Цикл
				
				НоваяСтрока = Таблица.Добавить();
				
				Для А = 0 По Выборка.Fields.Count - 1 Цикл
					
					НоваяСтрока.Установить(А, Выборка.Fields(А).Value);

				КонецЦикла;

				Выборка.MoveNext();
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());

	КонецПопытки;
	
	Возврат Таблица;

КонецФункции
	
