
&НаСервере
Процедура ОтправитьВSQLНаСервере()
	Документы.ПрочиеПоказателиMDM.ОтправитьВSQLНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВSQL(Команда)
	ОтправитьВSQLНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПосмотретьЗаписьSQLНаСервере(Объект)
	ИнтеграцияДЗО.ПолучитьДанныеДокументаПрочиеПоказателиИзSQL(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЗаписьSQL(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ТекДанные.Статус <> ПредопределенноеЗначение("Перечисление.СтатусДокументаПрочиеПоказатели.Отправлен") Тогда
		ПоказатьПредупреждение(,"Проверить можно только документ со статусом ""Отправлен""");
		Возврат;
	КонецЕсли;
	
	Если ТекДанные <> Неопределено Тогда
		ОткрытьФорму("Обработка.ПосмотретьЗаписьSQLПрочиеПоказатели.Форма",Новый Структура("ДокПрочиеПоказатели",ТекДанные.Ссылка),ЭтаФорма);
	Иначе
		ПоказатьПредупреждение(,"Не выбран документ");
	КонецЕсли;
КонецПроцедуры
