
&НаСервере
Процедура УстановитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ТипОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНач = НачалоГода(ТекущаяДата());
	Иначе
		ДатаНач = ДатаНачала;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаКон = КонецГода(ТекущаяДата());
	Иначе
		ДатаКон = ДатаОкончания;
	КонецЕсли;
	
	Если Базы.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Базы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Базы КАК Базы
		               |ГДЕ
		               |	НЕ Базы.ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		
		СписокБаз = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СписокБаз.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		СписокБаз = Базы.ВыгрузитьЗначения();
	КонецЕсли;	
	
	Для Каждого База Из СписокБаз Цикл
		Менеджер = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьМенеджерЗаписи();
		Менеджер.БазаДанных = База;
		Менеджер.ТипОтчета = ТипОтчета;
		Менеджер.Счет = Счет;
		Менеджер.ДатаНачала = ДатаНач;
		Менеджер.ДатаОкончания = ДатаКон;
		Менеджер.НеОчищать = НеОчищать;
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры
