&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		ЭлементЗатратОпеределяетсяАналитикой 			= Объект.ЭлементЗатратОпеределяетсяАналитикой;
		ЭлементДоходовОпеределяетсяАналитикой 			= Объект.ЭлементДоходовОпеределяетсяАналитикой;
		ТоварыПродукцияУслугиОпеределяетсяАналитикой 	= Объект.ТоварыПродукцияУслугиОпеределяетсяАналитикой;
		//ВалютаОпределяетсяАналитикой = Объект.ВалютаОпределяетсяАналитикой;
	КонецЕсли;
	
	ЭлементыФормы = ЭтаФорма.Элементы;
	//ЭлементыФормы.АналитикаПоЭлементамЗатрат.ТолькоПросмотр 		= Не Объект.Владелец.ЭлементыЗатрат;
	//ЭлементыФормы.АналитикаПоЭлементамДоходов.ТолькоПросмотр 		= Не Объект.Владелец.ЭлементыДоходов;
	//ЭлементыФормы.АналитикаПоТоварыПродукцияУслуги.ТолькоПросмотр 	= Не Объект.Владелец.ТоварыПродукцияУслуги;
	//ЭлементыФормы.АналитикаПоВалюте.ТолькоПросмотр 					= Не Объект.Владелец.Валюта;
	//ЭлементыФормы.АналитикаПоВерсии.ТолькоПросмотр 					= Не Объект.Владелец.Версия;
	//ЭлементыФормы.АналитикаПоКонтрагентам.ТолькоПросмотр 			= Не Объект.Владелец.Контрагенты;
	//ЭлементыФормы.АналитикаПоКомпаниям.ТолькоПросмотр 				= Не Объект.Владелец.Компания;
	//ЭлементыФормы.АналитикаПоПериодам.ТолькоПросмотр 				= Не Объект.Владелец.Период;
	//ЭлементыФормы.АналитикаПоСценариям.ТолькоПросмотр 				= Не Объект.Владелец.Сценарии;
	//ЭлементыФормы.АналитикаПоРынкамСбыта.ТолькоПросмотр 			= Не Объект.Владелец.РынокСбыта;
	//ЭлементыФормы.АналитикаПоВидамПерсонала.ТолькоПросмотр 			= Не Объект.Владелец.ВидПерсонала;
	//ЭлементыФормы.АналитикаПоТипамЗатрат.ТолькоПросмотр 			= Не Объект.Владелец.ТипыЗатрат;
	//ЭлементыФормы.АналитикаПоКаналамПродаж.ТолькоПросмотр 			= Не Объект.Владелец.КаналыПродаж;
	//ЭлементыФормы.АналитикаПоВидамДвижения.ТолькоПросмотр 			= Не Объект.Владелец.ВидыДвижения;
	//ЭлементыФормы.АналитикаПоКатегориямАктива.ТолькоПросмотр 		= Не Объект.Владелец.КатегорияАктива;

	//ЭлементыФормы.АналитикаПоЭлементамЗатрат.Видимость 			= Объект.Владелец.ЭлементыЗатрат;
	//ЭлементыФормы.АналитикаПоЭлементамДоходов.Видимость 		= Объект.Владелец.ЭлементыДоходов;
	//ЭлементыФормы.АналитикаПоТоварыПродукцияУслуги.Видимость 	= Объект.Владелец.ТоварыПродукцияУслуги;

	
	ЭлементыФормы.ГруппаПоЭлементамЗатрат.Видимость 		= Объект.Владелец.ЭлементыЗатрат;
	ЭлементыФормы.ГруппаПоЭлементамДоходов.Видимость 		= Объект.Владелец.ЭлементыДоходов;
	ЭлементыФормы.ГруппаТоварыУслуги.Видимость 				= Объект.Владелец.ТоварыПродукцияУслуги;
	ЭлементыФормы.ГруппаКатегорияАктива.Видимость 			= Объект.Владелец.КатегорияАктива;
	ЭлементыФормы.ГруппаВидПерсонала.Видимость 				= Объект.Владелец.ВидПерсонала;
	ЭлементыФормы.ГруппаТипыЗатрат.Видимость 				= Объект.Владелец.ТипыЗатрат;
 
	//ЭлементыФормы.АналитикаПоВалюте.ТолькоПросмотр 					= Не Объект.Владелец.Валюта;
	//ЭлементыФормы.АналитикаПоВерсии.ТолькоПросмотр 					= Не Объект.Владелец.Версия;
	//ЭлементыФормы.АналитикаПоКонтрагентам.ТолькоПросмотр 			= Не Объект.Владелец.Контрагенты;
	//ЭлементыФормы.АналитикаПоКомпаниям.ТолькоПросмотр 				= Не Объект.Владелец.Компания;
	//ЭлементыФормы.АналитикаПоПериодам.ТолькоПросмотр 				= Не Объект.Владелец.Период;
	//ЭлементыФормы.АналитикаПоСценариям.ТолькоПросмотр 				= Не Объект.Владелец.Сценарии;
	//ЭлементыФормы.АналитикаПоРынкамСбыта.ТолькоПросмотр 			= Не Объект.Владелец.РынокСбыта;
	//ЭлементыФормы.АналитикаПоКаналамПродаж.ТолькоПросмотр 			= Не Объект.Владелец.КаналыПродаж;
	//ЭлементыФормы.АналитикаПоВидамДвижения.ТолькоПросмотр 			= Не Объект.Владелец.ВидыДвижения;
	
	ЭлементыФормы.АналитикаПоВалюте.Видимость 				= Объект.Владелец.Валюта;
	ЭлементыФормы.АналитикаПоВерсии.Видимость 				= Объект.Владелец.Версия;
	ЭлементыФормы.АналитикаПоКонтрагентам.Видимость 		= Объект.Владелец.Контрагенты;
	ЭлементыФормы.АналитикаПоКомпаниям.Видимость 			= Объект.Владелец.Компания;
	ЭлементыФормы.АналитикаПоПериодам.Видимость 			= Объект.Владелец.Период;
	ЭлементыФормы.АналитикаПоСценариям.Видимость 			= Объект.Владелец.Сценарии;
	ЭлементыФормы.АналитикаПоРынкамСбыта.Видимость 			= Объект.Владелец.РынокСбыта;
	ЭлементыФормы.АналитикаПоКаналамПродаж.Видимость 		= Объект.Владелец.КаналыПродаж;
	ЭлементыФормы.АналитикаПоВидамДвижения.Видимость 		= Объект.Владелец.ВидыДвижения;
	

	ЭтоCFI = Объект.Владелец.Код = 6;
	ЭлементыФормы.СтраницаНастройкаАналитики.Видимость 			= Не ЭтоCFI;
	ЭлементыФормы.СтраницаНастройкаБДДСКосвенные.Видимость 		= ЭтоCFI;
	
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		ЭлементЗатратОпеределяетсяАналитикой 			= Объект.ЭлементЗатратОпеределяетсяАналитикой;
		ЭлементДоходовОпеределяетсяАналитикой 			= Объект.ЭлементДоходовОпеределяетсяАналитикой;
		ТоварыПродукцияУслугиОпеределяетсяАналитикой 	= Объект.ТоварыПродукцияУслугиОпеределяетсяАналитикой;
		ВидПерсоналаОпеределяетсяАналитикой 			= Объект.ВидПерсоналаОпеределяетсяАналитикой;
		ТипЗатратОпеределяетсяАналитикой 				= Объект.ТипЗатратОпеределяетсяАналитикой;
		
КонецПроцедуры                                  	


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	Если НЕ ЭлементыФормы.АналитикаПоЭлементамЗатрат.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоЭлементамЗатрат;
		
		ЭлементыФормы.ЭлементЗатратОпеределяетсяАналитикой.Доступность 	= ДоступностьПоля;
		ЭлементыФормы.УказанныйЭлементЗатрат.Доступность 				= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.ЭлементЗатратОпеределяетсяАналитикой;
		
		ЭлементыФормы.ЭлементЗатрат.Доступность 			= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.ЭлементЗатратОпеределяетсяАналитикой.Доступность  = Ложь;
		ЭлементыФормы.УказанныйЭлементЗатрат.Доступность 				= Ложь;
		ЭлементыФормы.ЭлементЗатрат.Доступность 						= Ложь;
	КонецЕсли;
	
	
	Если НЕ ЭлементыФормы.АналитикаПоЭлементамДоходов.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоЭлементамДоходов;
		
		ЭлементыФормы.ЭлементДоходовОпеределяетсяАналитикой.Доступность 	= ДоступностьПоля;
		ЭлементыФормы.УказанныйЭлементДоходов.Доступность 					= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.ЭлементДоходовОпеределяетсяАналитикой;
		
		ЭлементыФормы.ЭлементДоходов.Доступность 			= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.ЭлементДоходовОпеределяетсяАналитикой.Доступность  	= Ложь;
		ЭлементыФормы.УказанныйЭлементДоходов.Доступность 					= Ложь;
		ЭлементыФормы.ЭлементДоходов.Доступность 							= Ложь;
	КонецЕсли;
	
	
	
	Если НЕ ЭлементыФормы.АналитикаПоТоварыПродукцияУслуги.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоТоварыПродукцияУслуги;
		
		ЭлементыФормы.ТоварыПродукцияУслугиОпеределяетсяАналитикой.Доступность 	= ДоступностьПоля;
		ЭлементыФормы.УказанныйТоварыПродукцияУслуги.Доступность 				= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.ТоварыПродукцияУслугиОпеределяетсяАналитикой;
		
		ЭлементыФормы.ТоварыПродукцияУслуги.Доступность 			= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.ТоварыПродукцияУслугиОпеределяетсяАналитикой.Доступность  	= Ложь;
		ЭлементыФормы.УказанныйТоварыПродукцияУслуги.Доступность 					= Ложь;
		ЭлементыФормы.ТоварыПродукцияУслуги.Доступность 							= Ложь;
	КонецЕсли;
	
	
	
	Если НЕ ЭлементыФормы.АналитикаПоВидамПерсонала.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоВидамПерсонала;
		
		ЭлементыФормы.ВидПерсоналаОпеределяетсяАналитикой.Доступность 			= ДоступностьПоля;
		ЭлементыФормы.УказанныйВидПерсонала.Доступность 						= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.ВидПерсоналаОпеределяетсяАналитикой;
		
		ЭлементыФормы.ВидПерсонала.Доступность 			= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.ВидПерсоналаОпеределяетсяАналитикой.Доступность  	= Ложь;
		ЭлементыФормы.УказанныйВидПерсонала.Доступность 				= Ложь;
		ЭлементыФормы.ВидПерсонала.Доступность 							= Ложь;
	КонецЕсли;
	
	
	
	Если НЕ ЭлементыФормы.АналитикаПоТипамЗатрат.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоТипамЗатрат;
		
		ЭлементыФормы.ТипЗатратОпеределяетсяАналитикой.Доступность 			= ДоступностьПоля;
		ЭлементыФормы.УказанныйТипЗатрат.Доступность 						= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.ТипЗатратОпеределяетсяАналитикой;
		
		ЭлементыФормы.ТипЗатрат.Доступность 			= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.ТипЗатратОпеределяетсяАналитикой.Доступность  	= Ложь;
		ЭлементыФормы.УказанныйВидПерсонала.Доступность 				= Ложь;
		ЭлементыФормы.ТипЗатрат.Доступность 							= Ложь;
	КонецЕсли;
	
	
	
	Если НЕ ЭлементыФормы.АналитикаПоКатегориямАктива.ТолькоПросмотр Тогда
		
		ДоступностьПоля = Форма.Объект.АналитикаПоКатегориямАктива;
		
		ЭлементыФормы.КатегорияАктиваОпеределяетсяАналитикой.Доступность 	= ДоступностьПоля;
		ЭлементыФормы.УказанныйКатегорияАктива.Доступность 					= ДоступностьПоля;
		
		ОпределятьАналитику = Форма.КатегорияАктиваОпеределяетсяАналитикой;
		
		ЭлементыФормы.КатегорииАктивов.Доступность 							= ДоступностьПоля И НЕ ОпределятьАналитику;
		
	Иначе
		ЭлементыФормы.КатегорияАктиваОпеределяетсяАналитикой.Доступность  	= Ложь;
		ЭлементыФормы.УказанныйКатегорияАктива.Доступность 					= Ложь;
		ЭлементыФормы.КатегорииАктивов.Доступность 							= Ложь;
	КонецЕсли;
	
	
	//Если НЕ ЭлементыФормы.УчитыватьПоВалюте.ТолькоПросмотр Тогда
	//	ДоступностьВалюты = Форма.Объект.УчитыватьПоВалюте;
	//	ЭлементыФормы.ВалютаОпределяетсяАналитикой.Доступность = ДоступностьВалюты;
	//	ЭлементыФормы.ВалютаУказываетсяВВидеБюджета.Доступность = ДоступностьВалюты;
	//	ВалютаОпределяетсяАналитикой = Форма.ВалютаОпределяетсяАналитикой;
	//	ЭлементыФормы.АналитикаВалюты.Доступность = ДоступностьВалюты И ВалютаОпределяетсяАналитикой;
	//Иначе
	//	ЭлементыФормы.ВалютаОпределяетсяАналитикой.Доступность = Ложь;
	//	ЭлементыФормы.ВалютаУказываетсяВВидеБюджета.Доступность = Ложь;
	//	ЭлементыФормы.АналитикаВалюты.Доступность = Ложь;
	//КонецЕсли;
	//
	//Массив = Новый Массив;
	//Для Сч = 1 По 6 Цикл
	//	Массив.Добавить(Форма.Объект["ВидАналитики" + Сч]);
	//КонецЦикла;
	//
	//ПараметрыВыбора = Форма.Элементы.АналитикаЕдиницыИзмерения.ПараметрыВыбора;
	//МассивВыбора = Новый Массив(ПараметрыВыбора);
	//МассивВыбора[1] = 
	//	Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(Массив));
	//Форма.Элементы.АналитикаЕдиницыИзмерения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивВыбора);
	//
	//ПараметрыВыбора = Форма.Элементы.АналитикаВалюты.ПараметрыВыбора;
	//МассивВыбора = Новый Массив(ПараметрыВыбора);
	//МассивВыбора[1] = 
	//	Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(Массив));
	//Форма.Элементы.АналитикаВалюты.ПараметрыВыбора = Новый ФиксированныйМассив(МассивВыбора);
	
КонецПроцедуры


&НаКлиенте
Процедура АналитикаПоЭлементамЗатратПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьЭлементЗатратПриИзменении(Элемент)
	Если ЭлементЗатратОпеределяетсяАналитикой Тогда
		Объект.ЭлементЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ЭлементЗатратОпеределяетсяАналитикой = ЭлементЗатратОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура АналитикаПоЭлементамДоходовПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьЭлементДоходовПриИзменении(Элемент)
	Если ЭлементДоходовОпеределяетсяАналитикой Тогда
		Объект.ЭлементДоходов = ПредопределенноеЗначение("Справочник.Доходы.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ЭлементДоходовОпеределяетсяАналитикой = ЭлементДоходовОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АналитикаПоТоварыПродукцияУслугиПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьТоварыУслугиПриИзменении(Элемент)
	Если ТоварыПродукцияУслугиОпеределяетсяАналитикой Тогда
		Объект.ТоварыПродукцияУслуги = ПредопределенноеЗначение("Справочник.ТоварыИУслуги.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ТоварыПродукцияУслугиОпеределяетсяАналитикой = ТоварыПродукцияУслугиОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АналитикаПоВидПерсоналаПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьВидПерсоналаПриИзменении(Элемент)
	Если ВидПерсоналаОпеределяетсяАналитикой Тогда
		Объект.ВидПерсонала = ПредопределенноеЗначение("Справочник.ВидыПерсонала.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ВидПерсоналаОпеределяетсяАналитикой = ВидПерсоналаОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АналитикаПоТипамЗатратПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьТипЗатратПриИзменении(Элемент)
	Если ТипЗатратОпеределяетсяАналитикой Тогда
		Объект.ТипЗатрат = ПредопределенноеЗначение("Справочник.ТипыЗатрат.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ТипЗатратОпеределяетсяАналитикой = ТипЗатратОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АналитикаПоКатегориямАктиваПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КатегорияАктиваОпеределяетсяАналитикойПриИзменении(Элемент)
	//Если КатегорияАктиваОпеределяетсяАналитикой Тогда
	//	Объект.КатегорияАктива = ПредопределенноеЗначение("Справочник.КатегорииАктивов.ПустаяСсылка");
	//КонецЕсли;
	
	Объект.КатегорияАктиваОпеределяетсяАналитикой = КатегорияАктиваОпеределяетсяАналитикой;
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СчетаСчетПриИзменении(Элемент)
	ТекДанные = Элементы.Счета.ТекущиеДанные;
	Если ПроверитьЭлементыНижнегоУровня(ТекДанные.Счет) Тогда
		Сообщить("У выбранного элемента существуют элементы нижнего уровня. Необходимо выбирать элементы нижнего уровня. Поле очищено");
		ТекДанные.Счет = "";
	Конецесли;	
	
	Если ПроверитьЭлементИспользуется(ТекДанные.Счет) Тогда
		Сообщить("У выбранного элемента существуют элементы нижнего уровня. Необходимо выбирать элементы нижнего уровня. Поле очищено");
		ТекДанные.Счет = "";
	Конецесли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЭлементыНижнегоУровня(ТекСсылка)
	ИмяМета = ТекСсылка.Метаданные().Имя;
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ИмяМета+" КАК Спр
	|ГДЕ
	|	Спр.Родитель = &Родитель";
	запрос.УстановитьПараметр("Родитель",ТекСсылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		Возврат	Истина;
	КонецЕсли;	
	Возврат	Ложь;
	
КонецФункции

&НаСервере
Функция ПроверитьЭлементИспользуется(ТекСсылка)
	Если ТекСсылка.Метаданные().Реквизиты.Найти("НеИспользуется") = Неопределено Тогда
		Возврат Ложь;
	Иначе	
		Возврат	ТекСсылка.НеИспользуется;
	КонецЕсли;	
	
КонецФункции





