
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОчиститьТаблицыNewData(Команда)
	
	ОчиститьТаблицыNewDataНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТехническиеТаблицы(Команда) 
	
	ЗаполнитьТехническиеТаблицыНаСервере();  
	
КонецПроцедуры

 &НаКлиенте
Процедура ЗаполнитьСправочникиИзВременныхТаблиц(Команда) 
	
	ЗаполнитьСправочникиИзВременныхТаблицНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьТаблицы(Команда) 
	
	ИнициализироватьТаблицыНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги(Команда)
	ПересчитатьИтогиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций 

&НаСервереБезКонтекста
Процедура ИнициализироватьТаблицыНаСервере()

	Справочники.ЕдиныйФорматДанных.ИнициализироватьТаблицы();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСправочникиИзВременныхТаблицНаСервере()

	Справочники.ЕдиныйФорматДанных.ЗаполнитьСправочникиИзВременныхТаблиц();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТехническиеТаблицыНаСервере()

	Справочники.ЕдиныйФорматДанных.ЗаполнитьТехническиеТаблицы();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьТаблицыNewDataНаСервере()  
	
	Справочники.ЕдиныйФорматДанных.ОчиститьТаблицыNewData();  
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПересчитатьИтогиНаСервере()
	Справочники.ЕдиныйФорматДанных.ПересчитатьИтоги();
КонецПроцедуры


#КонецОбласти

