
&НаСервере
Процедура ОбновитьРегистрНаСервере()
	Результат =ИнтеграцияДЗО.GetTypesOfOtherIndicators();
	
	
	

	Для каждого стр из Результат.TypesOfOtherIndicators Цикл
		
		СпрССылка = Справочники.ВидыПрочихПоказателейMDM.НайтиПоКоду(стр.Code); 
		Если ЗначениеЗаполнено(СпрССылка) Тогда
			НаборПоказателя = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
			НаборПоказателя.Отбор.ВидПоказателя.Установить(СпрССылка);
			НаборПоказателя.Прочитать();
			НаборПоказателя.Очистить();
			НаборПоказателя.Записать();
		КонецЕсли;
		Если СпрССылка.Пустая() Тогда
			СпрОбъект = Справочники.авВидыПрочихПоказателейMDM.СоздатьЭлемент();	
		Иначе
			СпрОбъект = СпрССылка.ПолучитьОбъект();	
		КонецЕсли;
		
		СпрОбъект.Код = стр.Code;
		Для Каждого СтрОрганизация Из СпрОбъект.Организации Цикл
		Если стр.ArrayIndicatorMDM.IndicatorMDM.Количество() Тогда 
			
			Для Каждого IndicatorMDM Из стр.ArrayIndicatorMDM.IndicatorMDM Цикл
				СтрокаПоказателя = СпрОбъект.СтрокиПоказателей.Добавить();
				СтрокаПоказателя.Показатель = Справочники.INDПрочиеПоказатели.НайтиПоКоду(IndicatorMDM.Code); 
				
				Если IndicatorMDM.BudgetItem.Количество() Тогда 
					Для КАждого СтрокаБюджета Из IndicatorMDM.BudgetItem Цикл
						Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
						СтатьяБюджета = Справочники.СтатьиБюджетов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаБюджета.BudgetItem)); 
						Набор.Отбор.Период.Установить(СпрОбъект.Период);
						Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
						Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
						Набор.Отбор.Статьи.Установить(СтатьяБюджета);
						Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
						Набор.Прочитать();
						Набор.Очистить(); 
						Запись = Набор.Добавить();
						Запись.Период   = СпрОбъект.Период;  
						Запись.ВидПоказателя   = СпрОбъект.Ссылка;
						Запись.Показатель   = СтрокаПоказателя.Показатель;
						Запись.Статьи   = СтатьяБюджета;
						Запись.Организация   = СтрОрганизация.Организация;
						Запись.ТипСтатьи   = "Статья бюджета";
						Запись.СписокСчетовСтатейБюджета   = СтрокаБюджета.BudgetAccaunts;
						Набор.Записать(Истина);
					КонецЦикла;
					
				КонецЕсли; 
				
				
				Если IndicatorMDM.TypeMovement.Количество() Тогда 
					Для КАждого ВидДвижения Из IndicatorMDM.TypeMovement Цикл 
						ВДвижения = Справочники.ВидыДвижения.ПолучитьСсылку(Новый УникальныйИдентификатор(ВидДвижения));
						Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
						Набор.Отбор.Период.Установить(СпрОбъект.Период);
						Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
						Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
						Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
						Набор.Отбор.Статьи.Установить(ВДвижения); 
						Набор.Прочитать();
						Набор.Очистить(); 
						Запись = Набор.Добавить();
						Запись.Период   = СпрОбъект.Период;  
						Запись.ВидПоказателя   = СпрОбъект.Ссылка;
						Запись.Показатель   = СтрокаПоказателя.Показатель; 
						Запись.Организация   = СтрОрганизация.Организация;
						Запись.Статьи   = ВДвижения;
						Запись.ТипСтатьи   = "Вид движения";
						Набор.Записать(Истина);
					КонецЦикла;
					
				КонецЕсли;
				
				Если IndicatorMDM.Account.Количество() Тогда 
					Для КАждого Счет Из IndicatorMDM.Account Цикл  
						авСчет = Справочники.ПланСчетов.ПолучитьСсылку(Новый УникальныйИдентификатор(Счет.AccauntGUID));
						Если ЗначениеЗаполнено(авСчет) Тогда
							Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
							Набор.Отбор.Период.Установить(СпрОбъект.Период);
							Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
							Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
							Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
							Набор.Отбор.Статьи.Установить(авСчет); 
							Набор.Прочитать();
							Набор.Очистить(); 
							Запись = Набор.Добавить();
							Запись.Период   = СпрОбъект.Период;  
							Запись.ВидПоказателя   = СпрОбъект.Ссылка;
							Запись.Показатель   = СтрокаПоказателя.Показатель;
							Запись.Организация   = СтрОрганизация.Организация;
							Запись.Статьи   = авСчет;
							Запись.ТипСтатьи        = "Счет";
							Запись.ТипДвиженияСчета   = Счет.AccauntTypeMovement;
							Набор.Записать(Истина); 
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				
				
				
			КонецЦикла;
			
			
		КонецЕсли;
		//СпрОбъект.Записать();
		
		
	КонецЦикла;
	КонецЦикла;
	


	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРегистр(Команда)
	ОбновитьРегистрНаСервере();
КонецПроцедуры
