//*******************************************************************************************************
&НаСервере
Функция ПолучитьОбработку(Ссылка) Экспорт 

	Возврат Ссылка.ПолучитьОбъект().ОбработкаПолучения.Получить();
	
КонецФункции
//*******************************************************************************************************
&НаСервере
Функция ПолучитьОбработкуBase64(Ссылка) Экспорт 

	Обработка = ПолучитьОбработку(Ссылка);
	Если Обработка <> Неопределено Тогда
		Возврат Base64Строка(Обработка);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
//*******************************************************************************************************
&НаСервере
Функция ВыполнитьОбработку(Объект) Экспорт 
	
	ДвоичныеДанные = ПолучитьОбработку(Объект);
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла("." + Прав(Объект.ОбработкаПолученияНаименование, 3));
	
	ДвоичныеДанные.Записать(ПолноеИмяФайла);
	
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПолноеИмяФайла);

	Возврат Вычислить("ВнешняяОбработка." + СокрЛП(Объект.ИмяФункции) + "()");

КонецФункции
//*******************************************************************************************************

//*******************************************************************************************************
&НаСервере
Функция ПолучитьОбработкуОтчетность(Ссылка) Экспорт 

	Возврат Ссылка.ПолучитьОбъект().ОбработкаОтчетность.Получить();
	
КонецФункции
//*******************************************************************************************************
&НаСервере
Функция ПолучитьОбработкуОтчетностьBase64(Ссылка) Экспорт 

	Обработка = ПолучитьОбработкуОтчетность(Ссылка);
	Если Обработка <> Неопределено Тогда
		Возврат Base64Строка(Обработка);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
