 #Область ОбработчикиСобытийФормы
// Код процедур и функций

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() и Параметры.Свойство("Владелец") Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;   	
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		
		Если Параметры.Ключ.Пустая() Тогда
			ЗаполнитьТаблицуРеквизитовПоТипу(Объект.Владелец);			
		Иначе
			ЗаполнитьТаблицуРеквизитовОбъекта();
	    КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

 &НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.Реквизиты.Очистить();
	
	Для каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаРеквизитов Цикл
		
		НоваяСтрока = Объект.Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Реквизиты.Очистить();
	
	Для каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаРеквизитов Цикл
		
		НоваяСтрока = ТекущийОбъект.Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;   

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций   

  &НаКлиенте
  Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	  Если Объект.Владелец <> ВыбранноеЗначение Тогда
		  
		  Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			  
			  Режим = РежимДиалогаВопрос.ДаНет;
			  Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
			  ПоказатьВопрос(Оповещение, "Изменился тип Владельца. Таблица реквизитов будет перезаполнена. Продолжить выполнение операции?", Режим, 0);
			  
		  Иначе
			  ЗаполнитьТаблицуРеквизитовПоТипу(ВыбранноеЗначение); 
			  
		  КонецЕсли;  		  
		  
	  КонецЕсли;       
	  
  КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРеквизитов
// Код процедур и функций      

&НаКлиенте
Процедура ТаблицаРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовОбъекта() 
	
	  Запрос = Новый Запрос;
	
	  Запрос.УстановитьПараметр("Тип", Объект.Владелец); 
	  Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);

	  
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ЗначенияЭталоновРеквизиты.Реквизит КАК Реквизит,
	                 |	ЗначенияЭталоновРеквизиты.Значение КАК Значение,
	                 |	ЗначенияЭталоновРеквизиты.Ссылка.Владелец КАК Владелец
	                 |ПОМЕСТИТЬ ВТРеквизиты
	                 |ИЗ
	                 |	Справочник.ЗначенияЭталонов.Реквизиты КАК ЗначенияЭталоновРеквизиты
	                 |ГДЕ
	                 |	ЗначенияЭталоновРеквизиты.Ссылка = &Ссылка
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ТипыЭталоновРеквизиты.Реквизит КАК Реквизит,
	                 |	ВТРеквизиты.Значение КАК Значение
	                 |ИЗ
	                 |	ПланВидовХарактеристик.ТипыЭталонов.Реквизиты КАК ТипыЭталоновРеквизиты
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРеквизиты КАК ВТРеквизиты
	                 |		ПО (ВТРеквизиты.Владелец = ТипыЭталоновРеквизиты.Ссылка)
	                 |			И (ВТРеквизиты.Реквизит = ТипыЭталоновРеквизиты.Реквизит)
	                 |ГДЕ
	                 |	ТипыЭталоновРеквизиты.Ссылка = &Тип"; 
	  
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	  Пока Выборка.Следующий() Цикл
		  
			СтрокаТЗ = ЭтотОбъект.ТаблицаРеквизитов.Добавить();	 
			СтрокаТЗ.Реквизит = Выборка.Реквизит;
			СтрокаТЗ.Значение = Выборка.Значение;
		  
	  КонецЦикла; 
	
	
  КонецПроцедуры 
  
&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовПоТипу(ТипЭталона) 
	
	  Запрос = Новый Запрос;
	
	  Запрос.УстановитьПараметр("Тип", ТипЭталона);
	  
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ТипыЭталоновРеквизиты.Реквизит КАК Реквизит
	                 |ИЗ
	                 |	ПланВидовХарактеристик.ТипыЭталонов.Реквизиты КАК ТипыЭталоновРеквизиты
	                 |ГДЕ
	                 |	ТипыЭталоновРеквизиты.Ссылка = &Тип"; 
	  
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	 Пока Выборка.Следующий() Цикл
		  
			СтрокаТЗ = ЭтотОбъект.ТаблицаРеквизитов.Добавить();	 
			СтрокаТЗ.Реквизит = Выборка.Реквизит; 
				  
	  КонецЦикла; 
	
	
  КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьТаблицуРеквизитовПоТипу(Объект.Владелец);

КонецПроцедуры

#КонецОбласти
 
 


