//***********************************************************************************************************
&НаСервере
Функция СохранитьНаСервере()
	
	Возврат Справочники.ОбъектыКВыгрузке.ПолучитьФайлФормата(РеквизитФормыВЗначение("Объект"));
	
КонецФункции
//***********************************************************************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаСохранить.Доступность = ЗначениеЗаполнено(Объект.ФайлФорматаSQLНаименование);
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресФайла) Тогда 
		
		ТекущийОбъект.ФайлФорматаSQL = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СокрЛП(АдресФайла)));
		
	КонецЕсли;
	
КонецПроцедуры
//***********************************************************************************************************
&НаКлиенте
Процедура Сохранить(Команда)
	
	Данные = СохранитьНаСервере();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогОткрытияФайла.Фильтр				 = "Произвольный (*." + Прав(Объект.ФайлФорматаSQLНаименование, 3) + ")|*." + Прав(Объект.ФайлФорматаSQLНаименование, 3);
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = Объект.ФайлФорматаSQLНаименование;
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Данные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		
	КонецЕсли;     
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Функция ПоискДублей(Значение)
	
	Для каждого СтрокаРезультата Из Объект.ТипыБазы Цикл
		Если СтрокаРезультата.ТипБазы = Значение Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;
			
КонецФункции
//***********************************************************************************************************
&НаКлиенте
Процедура ТипыБазыТипБазыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ПоискДублей(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Данный тип базы уже присутствует в списке",,"Ошибка");
	КонецЕсли;
	
КонецПроцедуры
//***********************************************************************************************************
