
&НаСервере
Процедура ВыгрузитьНаСервере()
	
	РеквизитФормыВЗначение("Объект").Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНастройкиОтчетовНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыгрузитьНастройкиОтчетов();      
	//РеквизитФормыВЗначение("Объект").ВыгрузитьНастройкиОтчетовCFI();      
	ВыгрузитьCFIНаСервере();
//Сообщить(Ном);	
	
КонецПроцедуры

Процедура ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак)
	
			ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_rpt_ReportLineCFIStructures]
		|           ([ReportLine]
		|           ,[ExpenditureAnalytics]
		|           ,[CashFlowItemAnalytics]
		|           ,[RevenueAnalytics]
		|           ,[ReportLineAnalitycs]
		|           ,[TypesOfMovements]
		|           ,[Sign]
		|           ,[ID])
		|     VALUES
		|           (N'"+XMLСтрока(Ссылка)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяЗатрат),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяЗатрат, "map_Expenditures")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДвиженияДенежныхСредств, "map_CashFlowItems")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДоходов),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДоходов, "map_Revenues")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяБюджета),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяБюджета, "map_rpt_ReportLines")),0)+"'
		//|           ,'"+?(ЗначениеЗаполнено(Выборка.ДтКт),Выборка.ДтКт,NULL)+"'
		|           ,'"+?(ЗначениеЗаполнено(ВидДвижения),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(ВидДвижения, "map_TypesOfMovements")),0)+"'		
		|           ,'"+?(Знак=0,0,Знак)+"'
		|           ,'"+РеквизитФормыВЗначение("Объект").ПолучитьID(Ссылка, "map_rpt_ReportLines")+"')";
		
		Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьНастройкиОтчетов(Команда)
	
	ВыгрузитьНастройкиОтчетовНаСервере();
	ВыгрузитьCFIНаСервере();
КонецПроцедуры   

Процедура ВыгрузитьCFIНаСервере()
	ОбменSQL = Обработки.ОбменSQL.Создать();
	Команда = ОбменSQL.Соединение();
	Команда.CommandText = "
						|TRUNCATE TABLE [dbo].[map_rpt_ReportLineCFIStructures]";	
	Команда.Execute();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиБюджетовНастройкаCFI.Ссылка КАК Ссылка,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Владелец КАК Владелец,
	               |	СтатьиБюджетовНастройкаCFI.ЭлементСправочника КАК ЭлементСправочника,
	               |	СтатьиБюджетовНастройкаCFI.Знак КАК Знак,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиЗатрат)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяЗатрат,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.Доходы)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДоходов,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиБюджетов)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяБюджета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиДвиженияДенежныхСредств)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	               |	ВЫБОР
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотДт)
	               |			ТОГДА ""Дт""
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотКт)
	               |			ТОГДА ""Кт""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ДтКт,
	               |	СтатьиБюджетовНастройкаCFI.ВидДвижения КАК ВидДвижения,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Код КАК Код
	               |ИЗ
	               |	Справочник.СтатьиБюджетов.НастройкаCFI КАК СтатьиБюджетовНастройкаCFI
	               |ГДЕ
	               |	НЕ СтатьиБюджетовНастройкаCFI.ЭлементСправочника.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Файл = ПолучитьФайл(ПапкаДляВыгрузкиОбъекта, "data");	 
	Ном = 0;
	Пока Выборка.Следующий() Цикл 
		естьЗапись = Ложь;
		
		Ссылка  						= Выборка.Ссылка;	
		СтатьяЗатрат 					= Выборка.СтатьяЗатрат;
		СтатьяДвиженияДенежныхСредств	= Выборка.СтатьяДвиженияДенежныхСредств;
		СтатьяДоходов 					= Выборка.СтатьяДоходов;
		СтатьяБюджета 					= Выборка.СтатьяБюджета;
		ВидДвижения 					= Выборка.ВидДвижения;
		Знак 							= Выборка.Знак;
		
		Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			|	СтатьиЗатрат.Ссылка КАК Статья
			|ИЗ
			|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
			|ГДЕ
			|	СтатьиЗатрат.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяЗатрат);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,рез.Статья,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
			               |ГДЕ
			               |	СтатьиДвиженияДенежныхСредств.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДвиженияДенежныхСредств);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,рез.Статья,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		

		Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	Доходы.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.Доходы КАК Доходы
			               |ГДЕ
			               |	Доходы.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДоходов);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,рез.Статья,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиБюджетов.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиБюджетов КАК СтатьиБюджетов
			               |ГДЕ
			               |	СтатьиБюджетов.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяБюджета);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,рез.Статья,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
		КонецЕсли; 
		
		если Не естьЗапись Тогда
			ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			Ном = Ном+1;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры	



///временная для интеграции с копией скуль


Процедура ВыгрузитьCFIНаСервереBW_AMD_COPY()
	
	ОбменSQL = Обработки.ОбменSQL.Создать();
	Команда = СоединениеBW_AMD_COPY().Команда;
	Команда.CommandText = "
						|TRUNCATE TABLE [dbo].[map_rpt_ReportLineCFIStructures]";	
	Команда.Execute();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиБюджетовНастройкаCFI.Ссылка КАК Ссылка,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Владелец КАК Владелец,
	               |	СтатьиБюджетовНастройкаCFI.ЭлементСправочника КАК ЭлементСправочника,
	               |	СтатьиБюджетовНастройкаCFI.Знак КАК Знак,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиЗатрат)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяЗатрат,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.Доходы)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДоходов,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиБюджетов)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяБюджета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиДвиженияДенежныхСредств)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	               |	ВЫБОР
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотДт)
	               |			ТОГДА ""Дт""
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотКт)
	               |			ТОГДА ""Кт""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ДтКт,
	               |	СтатьиБюджетовНастройкаCFI.ВидДвижения КАК ВидДвижения,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Код КАК Код
	               |ИЗ
	               |	Справочник.СтатьиБюджетов.НастройкаCFI КАК СтатьиБюджетовНастройкаCFI
	               |ГДЕ
	               |	НЕ СтатьиБюджетовНастройкаCFI.ЭлементСправочника.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Файл = ПолучитьФайл(ПапкаДляВыгрузкиОбъекта, "data");	 
	Ном = 0;
	Пока Выборка.Следующий() Цикл 
		естьЗапись = Ложь;
		
		Ссылка  						= Выборка.Ссылка;	
		СтатьяЗатрат 					= Выборка.СтатьяЗатрат;
		СтатьяДвиженияДенежныхСредств	= Выборка.СтатьяДвиженияДенежныхСредств;
		СтатьяДоходов 					= Выборка.СтатьяДоходов;
		СтатьяБюджета 					= Выборка.СтатьяБюджета;
		ВидДвижения 					= Выборка.ВидДвижения;
		Знак 							= Выборка.Знак;
		
		Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			|	СтатьиЗатрат.Ссылка КАК Статья
			|ИЗ
			|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
			|ГДЕ
			|	СтатьиЗатрат.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяЗатрат);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,рез.Статья,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
			               |ГДЕ
			               |	СтатьиДвиженияДенежныхСредств.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДвиженияДенежныхСредств);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,рез.Статья,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		

		Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	Доходы.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.Доходы КАК Доходы
			               |ГДЕ
			               |	Доходы.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДоходов);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,рез.Статья,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиБюджетов.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиБюджетов КАК СтатьиБюджетов
			               |ГДЕ
			               |	СтатьиБюджетов.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяБюджета);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,рез.Статья,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
		КонецЕсли; 
		
		если Не естьЗапись Тогда
			ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			Ном = Ном+1;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьCFI(Команда)
	ВыгрузитьCFIНаСервереBW_AMD_COPY();
КонецПроцедуры

Процедура ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак)
	
			ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_rpt_ReportLineCFIStructures]
		|           ([ReportLine]
		|           ,[ExpenditureAnalytics]
		|           ,[CashFlowItemAnalytics]
		|           ,[RevenueAnalytics]
		|           ,[ReportLineAnalitycs]
		|           ,[TypesOfMovements]
		|           ,[Sign]
		|           ,[ID])
		|     VALUES
		|           (N'"+XMLСтрока(Ссылка)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяЗатрат),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяЗатрат, "map_Expenditures")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДвиженияДенежныхСредств, "map_CashFlowItems")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДоходов),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДоходов, "map_Revenues")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяБюджета),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяБюджета, "map_rpt_ReportLines")),0)+"'
		//|           ,'"+?(ЗначениеЗаполнено(Выборка.ДтКт),Выборка.ДтКт,NULL)+"'
		|           ,'"+?(ЗначениеЗаполнено(ВидДвижения),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(ВидДвижения, "map_TypesOfMovements")),0)+"'		
		|           ,'"+?(Знак=0,0,Знак)+"'
		|           ,'"+РеквизитФормыВЗначение("Объект").ПолучитьID(Ссылка, "map_rpt_ReportLines")+"')";
		
		
	//Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);

	СтркутураСоединения = СоединениеBW_AMD_COPY();
	Попытка
		СтркутураСоединения.Соединение.Execute(ТекстЗапросаЗаписи,,128);
	Исключение  
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	


Функция СоединениеBW_AMD_COPY() Экспорт
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	База  = НастройкиОбмена.БазаДанныхSQL;
	База  = "BW_AMD_COPY";
	
	Попытка
		
		Команда     = Новый COMОбъект("ADODB.Command");
		Выборка     = Новый COMОбъект("ADODB.RecordSet");
		Соединение  = Новый COMОбъект("ADODB.Connection");
		
		Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + НастройкиОбмена.ИнстансSQL + ";" + "UID=" + НастройкиОбмена.ЛогинSQL + ";" + "PWD=" + НастройкиОбмена.ПарольSQL +";" + "DATABASE=" + База + ";";
		
		Соединение.CommandTimeout	 = 600;
		Соединение.ConnectionTimeout = 180;
		
		Соединение.Open();
		
		Команда.ActiveConnection = Соединение;
		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Выборка SQL", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;
	СтркутураСоединения = Новый Структура("Команда,Выборка,Соединение",Команда,Выборка,Соединение);
	Возврат СтркутураСоединения;
	
КонецФункции

