
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Владелец) Тогда 
		Объект.Наименование = Строка(Объект.Владелец);
	КонецЕсли;
	
	Бюджет = Справочники.Бюджеты.НайтиПоКоду(1);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиБюджетаСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Отбор",НОвый Структура("Владелец",Бюджет ));
	ОткрытьФорму("Справочник.СтатьиБюджетов.ФормаВыбора",Отбор,Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Владелец) Тогда 
		Объект.Наименование = Строка(Объект.Владелец);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДвиженияСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Отбор",НОвый Структура("Владелец",Бюджет ));
	ОткрытьФорму("Справочник.СтатьиБюджетов.ФормаВыбора",Отбор,Элемент); 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановитьДоступностьСтраниц(); 
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьСтраниц()	

	 Элементы.ГруппаСтатьиБюджета.Доступность  = (Объект.ВидыДвижения.Количество() = 0 И Объект.Счета.Количество() = 0);
	 Элементы.ГруппаВидыДвижений.Доступность   = (Объект.СтатьиБюджета.Количество() = 0 И Объект.Счета.Количество() = 0);
	 Элементы.ГруппаСчета.Доступность          = (Объект.ВидыДвижения.Количество() = 0 И Объект.СтатьиБюджета.Количество() = 0);
	 

КонецПроцедуры // 	УстановитьДоступностьСтраниц();

&НаКлиенте
Процедура СтатьиБюджетаПриИзменении(Элемент)
	УстановитьДоступностьСтраниц(); 
КонецПроцедуры

&НаКлиенте
Процедура ВидыДвиженияПриИзменении(Элемент)
	УстановитьДоступностьСтраниц(); 
КонецПроцедуры

&НаКлиенте
Процедура СчетаПриИзменении(Элемент)
	УстановитьДоступностьСтраниц(); 
КонецПроцедуры
