#Область ПрограммныйСлужебныйИнтерфейс
Процедура ЗаполнитьТаблицуБазы() Экспорт
	
	Коннектор = ОбменSQLСервер.ПолучитьКоннектор();
  	
   	Команда = 
	"SET ANSI_NULLS ON
	|SET QUOTED_IDENTIFIER ON
	|
	|IF EXISTS (SELECT * FROM sys.objects WHERE object_id = OBJECT_ID(N'[dbo].[Bases]') AND type in (N'U'))
	|BEGIN
	|	DROP TABLE [dbo].[Bases]		
	|END
	|	CREATE TABLE [dbo].[Bases](
	|		[Base] [nvarchar](50) NULL,
	|		[local] [bit] NULL
	|	) ON [PRIMARY]";
	
	Коннектор.ВыполнитьПроизвольныйDMLЗапрос(Команда);
	
	//++ 28.05.2024 Кибернетика Корыткин А.А. изменение структуры таблицы Bases для совместимости со скриптами
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Базы.Наименование КАК Наименование,
	|	Базы.Локальная КАК Локальная
	|ИЗ
	|	Справочник.Базы КАК Базы
	|ГДЕ
	|	НЕ Базы.ЭтоГруппа
	|	И НЕ Базы.ПометкаУдаления";
	
	Команда = ""; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Команда = Команда + "
		|    
		|IF NOT EXISTS (SELECT 1 FROM Bases WHERE [Base] = '" + Выборка.Наименование + "')
		|	INSERT INTO Bases ([Base], [local]) VALUES ('" + Выборка.Наименование + "' , '" + 
		?(Выборка.Локальная, 1, 0) + "')";		
	КонецЦикла;  
	//-- 28.05.2024
	
	Коннектор.ВыполнитьПроизвольныйDMLЗапрос(Команда);
	
КонецПроцедуры    
#КонецОбласти