//******************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ;
	
	ВидимостьСчетов();
	
КонецПроцедуры
//******************************************************************************************
&НаСервере
Процедура ВидимостьСчетов()

	Объект.ТабличнаяЧасть.Очистить();

	Элементы.Счет.Видимость				 = НЕ (Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ);
	Элементы.ТабличнаяЧасть.Видимость	 = (Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ);
	
КонецПроцедуры
//******************************************************************************************
&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	
	ВидимостьСчетов();
	
КонецПроцедуры
//******************************************************************************************
&НаСервере
Функция ДобавитьНаСервере()
	
	Попытка
		
		Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда 
			
			Регистр = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьНаборЗаписей();
			
			Для Каждого Стр Из Объект.ТабличнаяЧасть Цикл 
				
				НоваяЗапись = Регистр.Добавить(); 
				
				НоваяЗапись.Счет			 = Стр.Счет; 
				НоваяЗапись.ТипОтчета		 = Объект.ТипОтчета; 
				НоваяЗапись.БазаДанных		 = Объект.База; 
				НоваяЗапись.ДатаНачала		 = Объект.Период.ДатаНачала; 
				НоваяЗапись.ДатаОкончания	 = Объект.Период.ДатаОкончания; 
				
			КонецЦикла; 
			
			Регистр.Записать();
			
		Иначе 	
			
			Регистр = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьМенеджерЗаписи();
			
			Регистр.Счет			 = Объект.Счет; 
			Регистр.ТипОтчета		 = Объект.ТипОтчета; 
			Регистр.БазаДанных		 = Объект.База; 
			Регистр.ДатаНачала		 = Объект.Период.ДатаНачала; 
			Регистр.ДатаОкончания	 = Объект.Период.ДатаОкончания; 
			
			Регистр.Записать();
			
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
//******************************************************************************************
&НаКлиенте
Процедура Добавить(Команда)
	
	Если ДобавитьНаСервере() Тогда 
		
		ПоказатьПредупреждение(, "Задание к выгрузке отчетов добавлено");
		
	КонецЕсли;
	
КонецПроцедуры
//******************************************************************************************

