
&НаСервере
Процедура ПовыситьВерсиюВсехПоказателейНаСервере() 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыПрочихПоказателейMDM.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыПрочихПоказателейMDM КАК ВидыПрочихПоказателейMDM";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		ВидПоказателяОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВидПоказателяОбъект.НомерВерсии = ВидПоказателяОбъект.НомерВерсии +1;
		ВидПоказателяОбъект.РежимЗаписиЭкстренный = Истина;
		Попытка 
			ВидПоказателяОбъект.Записать();                  
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла; 
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Показатель = ВыборкаДетальныеЗаписи.Ссылка;
		Для Каждого Организация Из Показатель.Организации Цикл 
			Набор = РегистрыСведений.ОбновленияПрочихПоказателей.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(Организация.Организация);
			Набор.Отбор.ВидПрочегоПоказателя.Установить(Показатель); 
			Набор.Прочитать();
			Набор.Очистить();
			Запись = Набор.Добавить();
			Запись.Организация = Организация.Организация;
			Запись.ВидПрочегоПоказателя = Показатель;
			Запись.НомерВерсии = Показатель.НомерВерсии;
			Набор.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПовыситьВерсиюВсехПоказателей(Команда)
	ПовыситьВерсиюВсехПоказателейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВSQL(Команда)
	ЗаписатьВSQLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВSQLНаСервере()
	ИнтеграцияДЗО.ЗаписатьСправочникВ_SQL("ВидыПрочихПоказателейMDM","map_IND_Type",Ложь);
КонецПроцедуры
