#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗагрузку() Экспорт
	
	СтруктураПараметров = Новый Структура("СпособЗагрузки, ИмяФайлаЗагрузки", ?(ЗначениеЗаполнено(ЭтотОбъект.Конфигурация), 1, 0), ЭтотОбъект.ИмяФайлаЗагрузки);
	СтруктураПараметров.Вставить("Конфигурация", ЭтотОбъект.Конфигурация);
	СтруктураПараметров.Вставить("ДобавлятьТолькоНовые", ЭтотОбъект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения);
	
	Адрес = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	Обработки.ЗагрузкаСтруктурыКонфигурации.ВыполнитьЗагрузкуМетаданных(СтруктураПараметров, Адрес);
		
КонецПроцедуры

#КонецОбласти