//******************************************************************************************
&НаСервере
Функция ЗаполнитьНаСервере()
	
	НаименованиеМакета = "";
	
	Для Каждого Макет Из Метаданные.Справочники.СчетУчета.Макеты Цикл 
		
		//Если СокрЛП(Макет.Синоним) = СокрЛП(Объект.Владелец.Наименование) Тогда 
		//	
		//	НаименованиеМакета = Макет.Имя;
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(НаименованиеМакета) Тогда 

		Возврат Ложь;
		
	КонецЕсли;
	
	Объект.Счета.Очистить();
	Объект.Аналитика.Очистить();
	
	ТекущийМакет = Справочники.СчетУчета.ПолучитьМакет(НаименованиеМакета);

	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("_1",	 "Счет");
	Соответствие.Вставить("_2",	 "Наименование");
	Соответствие.Вставить("_3",	 "Активный");
	Соответствие.Вставить("_4",	 "Валютный");
	Соответствие.Вставить("_6",	 "Субконто1");
	Соответствие.Вставить("_5",	 "Количественный");
	Соответствие.Вставить("_7",	 "Субконто2");
	Соответствие.Вставить("_8",	 "Субконто3");
	Соответствие.Вставить("_9",	 "Субконто4");
	Соответствие.Вставить("_10", "Субконто5");
	
	Для Строка = 2 По ТекущийМакет.ВысотаСтраницы Цикл
		
		СтруктураСчета = Новый Структура;
		
		Для Колонка = 1 По 10 Цикл
			
			Значение = ТекущийМакет.Область("R" + Строка + "C" + Колонка).Текст;
			
			Если НЕ ПустаяСтрока(Значение) Тогда
				
				СтруктураСчета.Вставить(Соответствие.Получить("_" + Колонка), Значение);
				
			КонецЕсли;      
			
		КонецЦикла;
		
		Если СтруктураСчета.Свойство("Счет") Тогда
			
			ЗаполнитьЗначенияСвойств(Объект.Счета.Добавить(),		 СтруктураСчета);
			ЗаполнитьЗначенияСвойств(Объект.Аналитика.Добавить(),	 СтруктураСчета);
			
		КонецЕсли;      
		
	КонецЦикла;
	
	Объект.Счета.Сортировать("Счет Возр");
	Объект.Аналитика.Сортировать("Счет Возр");

	Возврат Истина;

КонецФункции
//******************************************************************************************
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;

	Если НЕ ЗаполнитьНаСервере() Тогда 
		
		ПоказатьПредупреждение(, "Не найден макет для данного типа базы");
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
//******************************************************************************************
&НаКлиенте
Процедура Заполнить(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда 
	//	
	//	ПоказатьПредупреждение(, "Выберите тип базы!");
	//	
	//	Возврат;
	//	
	//КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры), "Данные будут очищены, продолжить?", РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры
//******************************************************************************************
