#Область ПрограммныйИнтерфейс

// Формирует и возвращает объект обработки для подключения к базе данных SQL на основе переданных настроек обмена.
//
// Параметры:
//  НастройкиОбмена - Структура, СправочникСсылка.НастройкиОбмена, Неопределено - настройки для подключения к базе данных.
//                    Если передана структура, она должна содержать ключи: База, Сервер, Пользователь, Пароль.
//                    Если передан неподходящий тип или структура не содержит всех необходимых ключей,
//                    используются настройки из константы ОсновныеНастройкиОбмена.
//                    Если передано Неопределено, также используются настройки из константы ОсновныеНастройкиОбмена.
//
// Возвращаемое значение:
//  ОбработкаОбъект.КоннекторСУБД - объект обработки для подключения к базе данных SQL.
//
// Пример:
//  Настройки = Новый Структура;
//  Настройки.Вставить("База", "DatabaseName");
//  Настройки.Вставить("Сервер", "ServerName");
//  Настройки.Вставить("Пользователь", "UserName");
//  Настройки.Вставить("Пароль", "Password");
//  Коннектор = ПолучитьКоннектор(Настройки);Функция ПолучитьКоннектор(НастройкиОбмена = Неопределено) Экспорт
Функция ПолучитьКоннектор(НастройкиОбмена = Неопределено) Экспорт
	
	Если НастройкиОбмена = Неопределено Тогда
		НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();		
	ИначеЕсли ТипЗнч(НастройкиОбмена) = Тип("Структура") Тогда
		
		Если Не (НастройкиОбмена.Свойство("База") 
			И НастройкиОбмена.Свойство("Сервер")
			И НастройкиОбмена.Свойство("Пользователь") 
			И НастройкиОбмена.Свойство("Пароль")) Тогда
			НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить(); 
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(НастройкиОбмена) <> Тип("СправочникСсылка.НастройкиОбмена") Тогда		
		 НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Параметры = Новый Структура;
	Параметры.Вставить("База", НастройкиОбмена.БазаДанныхSQL);
	Параметры.Вставить("Сервер", НастройкиОбмена.ИнстансSQL);
	Параметры.Вставить("Пользователь", НастройкиОбмена.ЛогинSQL);
	Параметры.Вставить("Пароль", НастройкиОбмена.ПарольSQL);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбменSQLПовтИсп.ПолучитьКоннектор(Параметры);

КонецФункции
#КонецОбласти