
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыВнешнихОбработок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыВнешнихОбработок КАК ВидыВнешнихОбработок
	               |ГДЕ
	               |	ВидыВнешнихОбработок.Ссылка <> &Ссылка
	               |	И ВидыВнешнихОбработок.СлужебноеИмя = &СлужебноеИмя";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СлужебноеИмя", СлужебноеИмя);
	
	Результат = Запрос.Выполнить(); 
	Если НЕ Результат.Пустой() Тогда                                           
		
		Сообщить("Уже существует вид внешней обработки с таким служебным именем");
	    Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти