

#Область ОбработчикиСобытий
// Код процедур и функций  

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Обработка.ВыгрузкаЭталонныхСправочников.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	СинхронизироватьДанные();
		
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций  

&НаСервере
Процедура СинхронизироватьДанные()
	РаботаСЭталонамиСервер.ЗагрузитьДанныеСИсточника(); 
КонецПроцедуры  

#КонецОбласти