#Область ОбработчикиСобытийКоманд

// Обработчик команды "ВыполнитьСценарий"
&НаКлиенте
Процедура ВыполнитьСценарий(Команда)
	
	Если Модифицированность Или Параметры.Ключ.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("МодифицированностьПередВыполнением", ЭтотОбъект), 
			"Сценарий изменен. Записать?", РежимДиалогаВопрос.ДаНет);
	ИначеЕсли Объект.ПроцедурыSQL.Количество() > 0 Тогда
		ВыполнитьСценарийНаСервере(Параметры.Ключ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик результата вопроса о модифицированности перед выполнением сценария
&НаКлиенте
Процедура МодифицированностьПередВыполнением(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		Если Объект.ПроцедурыSQL.Количество() > 0 Тогда
			ВыполнитьСценарийНаСервере(Параметры.Ключ);	
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

// Выполняет сценарий на сервере
&НаСервереБезКонтекста
Процедура ВыполнитьСценарийНаСервере(Ссылка) 
	
	ОбменSQL = Обработки.ОбменSQL.Создать();
	ОбменSQL.ВыполнитьСценарий(Ссылка);
	
КонецПроцедуры

#КонецОбласти