//****************************************************************************************************
Процедура Отправить(Настройки, КаталогНаFTP, ФайлНаКомпьютере, ФайлНаFTP)
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	
	FTPСоединение = Новый FTPСоединение(НастройкиОбмена.АдресFTP, НастройкиОбмена.Порт, НастройкиОбмена.Логин, НастройкиОбмена.Пароль);
	
	FTPСоединение.УстановитьТекущийКаталог("/");
	
	FTPСоединение.Записать(ФайлНаКомпьютере, ФайлНаFTP);
	
КонецПроцедуры
//****************************************************************************************************
Процедура Скачать(НастройкиОбмена) Экспорт 

	FTPСоединение = Новый FTPСоединение(НастройкиОбмена.АдресFTP, НастройкиОбмена.Порт, НастройкиОбмена.Логин, НастройкиОбмена.Пароль,, НастройкиОбмена.ПассивноеСоединение);
	
	FTPСоединение.УстановитьТекущийКаталог(СокрЛП(НастройкиОбмена.КаталогFTP));
	
	НайденныеФайлы = FTPСоединение.НайтиФайлы(СокрЛП(НастройкиОбмена.КаталогFTP), "*.*");
	
	Для А = 0 По НайденныеФайлы.Количество() - 1 Цикл 
		
		Если НайденныеФайлы[А].ЭтоКаталог() Тогда 
			
			Продолжить;
			
		КонецЕсли;
	
		FTPСоединение.Получить(НайденныеФайлы[А].ПолноеИмя, НастройкиОбмена.ПутьККаталогуЗагрузкиФайлов + ?(Прав(НастройкиОбмена.ПутьККаталогуЗагрузкиФайлов, 1) = "\", "", "\" ) + СтрЗаменить(НайденныеФайлы[А].ПолноеИмя, СокрЛП(НастройкиОбмена.КаталогFTP), ""));
		
		Если НастройкиОбмена.УдалятьФайлыПослеСкачивания Тогда 
		
			FTPСоединение.Удалить(НайденныеФайлы[А].ПолноеИмя);
		
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
//****************************************************************************************************