Процедура ПолучитьСписокЭлементовСправочника(
	  ИмяСправочника,
	  Иерархический = Ложь,
	  СписокВладельцев = Неопределено,
	  СписокПомеченных = Неопределено)   Экспорт
	  СтруктураПараметров = Новый Структура;
	  СтруктураПараметров.Вставить("ИмяСправочника",ИмяСправочника);
	  СтруктураПараметров.Вставить("Иерархический",Иерархический);
	  СтруктураПараметров.Вставить("СписокВладельцев",СписокВладельцев);
	  СтруктураПараметров.Вставить("СписокПомеченных",СписокПомеченных);
	  ФормаВыбораЭлементовСправочника = ОткрытьФорму("ОбщаяФорма.ВыборЭлементовСправочника",СтруктураПараметров);
КонецПроцедуры // ПолучитьСписокЭлементовСправочника()
  