
&НаСервере
Процедура УровеньИерархииПриИзмененииНаСервере() 
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВидыПрочихПоказателейMDMСтрокиПоказателей.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.ВидыПрочихПоказателейMDM.СтрокиПоказателей КАК ВидыПрочихПоказателейMDMСтрокиПоказателей
	//	|ГДЕ
	//	|	ВидыПрочихПоказателейMDMСтрокиПоказателей.Показатель = &Показатель";
	//
	//Запрос.УстановитьПараметр("Показатель", Объект.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
	//	
	//	ВидПоказателяОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	
	//	Для Каждого СтрПоказатель Из ВидПоказателяОбъект.СтрокиПоказателей Цикл  
	//		
	//		
	//		Если СтрПоказатель.Показатель = Объект.Ссылка Тогда  
	//			 СтрПоказатель.УровеньИерархии = СтрПоказатель.Показатель.УровеньИерархии;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	ВидПоказателяОбъект.Записать();
	//	
	//КонецЦикла;
	//

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УровеньИерархииПриИзменении(Элемент)
	УровеньИерархииПриИзмененииНаСервере();
КонецПроцедуры
