
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ Отказ Тогда
		Движения.ПлановыеДанныеОтчетов.Записывать = Истина;
		Для Каждого ТекСтрокаДанныеОтчетов Из ДанныеОтчетов Цикл
			Движение = Движения.ПлановыеДанныеОтчетов.Добавить();
			Движение.Период = ТекСтрокаДанныеОтчетов.Период;
			Движение.Организация = Организация;
			Движение.Сценарий = Сценарий;
			Движение.ВидОтчета = ТекСтрокаДанныеОтчетов.ВидОтчета;
			Движение.СтрокаОтчета = ТекСтрокаДанныеОтчетов.СтрокаОтчета;
			Движение.АналитикаСтрокиОтчета = ТекСтрокаДанныеОтчетов.АналитикаСтрокиОтчета;
			Движение.Валюта = ТекСтрокаДанныеОтчетов.Валюта;
			Движение.Сумма = ТекСтрокаДанныеОтчетов.Сумма;
			Движение.Количество = ТекСтрокаДанныеОтчетов.Количество;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
