
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокПрочиеПоказатели",ДокПрочиеПоказатели); 
	
	Реквизиты = Новый Массив;
	ТаблицаДанных = Новый РеквизитФормы("ТаблицаДанных",Новый ОписаниеТипов("ТаблицаЗначений"));
	Реквизиты.Добавить(ТаблицаДанных); 
	ИзменитьРеквизиты(Реквизиты);
	НовыйЭлементТЗ = Элементы.Добавить("ТаблицаДанных",Тип("ТаблицаФормы"),Элементы["СтраницаРезультат"]);
	НовыйЭлементТЗ.ПутьКДанным = "ТаблицаДанных";
	//НовыйЭлементТЗ.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	МассивКолонокТЗ = Новый Массив;
	Выборка = ИнтеграцияДЗО.ПолучитьДанныеДокументаПрочиеПоказателиИзSQLПерваяЗапись(ДокПрочиеПоказатели);
	Для Каждого ЭлементВыборки Из Выборка.Fields Цикл
		
		Реквизит = Новый РеквизитФормы(ЭлементВыборки.Name,Новый ОписаниеТипов(ОпределитьТипКолонки(ЭлементВыборки.Type)),"ТаблицаДанных");
		МассивКолонокТЗ.Добавить(Реквизит);
		
	КонецЦикла;
	ИзменитьРеквизиты(МассивКолонокТЗ);
	
	Для Каждого ЭлементВыборки Из Выборка.Fields Цикл
		
		НовыйЭлементКод = Элементы.Добавить(ЭлементВыборки.Name,Тип("ПолеФормы"),НовыйЭлементТЗ);
		НовыйЭлементКод.ПутьКДанным = "ТаблицаДанных."+ЭлементВыборки.Name;
		НовыйЭлементКод.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлементКод.Ширина= 15;
		
	КонецЦикла;
	ТЗ = РеквизитФормыВЗначение("ТаблицаДанных");
	ВыборкаДанных = ИнтеграцияДЗО.ПолучитьДанныеДокументаПрочиеПоказателиИзSQL(ДокПрочиеПоказатели); 
	
	
	Если ВыборкаДанных.BOF = Ложь Тогда
		ВыборкаДанных.MoveFirst();
		Пока ВыборкаДанных.EOF = Ложь Цикл 
			
			СтрокаТЗ = ТЗ.Добавить();
			Для Каждого ЭлементВыборки Из ВыборкаДанных.Fields Цикл
				
				//Если СокрЛП(ЭлементВыборки.Name) <> "RegistratorNumber" Тогда
					СтрокаТЗ[ЭлементВыборки.Name] = ЭлементВыборки.Value;     
				//КонецЕсли;	

			КонецЦикла;
			
			ВыборкаДанных.MoveNext();
		КонецЦикла;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаДанных");
	
КонецПроцедуры

Функция ОпределитьТипКолонки(НомерТипа)
	
	Если НомерТипа = 131 Тогда
		Возврат "Число";
	ИначеЕсли НомерТипа = 202 Тогда 
		Возврат "Строка";
	ИначеЕсли НомерТипа = 11 Тогда
		Возврат "Булево";
	ИначеЕсли НомерТипа = 11 Тогда
		Возврат "Булево";
	ИначеЕсли НомерТипа = 135 Тогда
		Возврат "Дата";
	КонецЕсли;
	
КонецФункции
