// Процедура генерирует код перемещаемого элемента (группы) справочника,
// а также код расположенного рядом элемента при интерактивном перемещении
// элемента в форме списка справочника.
// Записывает переставляемые элементы с измененными кодами.
// В случае сдвига группы элементов также изменяет коды вложенных в группу
// элементов.
//
// Параметры
// Направление – число – напрвление сдвига элемента,
// принимает значения:
// 1 - при сдвиге вниз;
// -1 - при сдвиге вверх.
//
Процедура ИзменитьКод(Направление) Экспорт
	
	//#Если Клиент Тогда
		
		ТекущийКод = Код;
		
		СписокКодов = Новый СписокЗначений;
		
		СтатьиБюджета = Справочники.СтатьиБюджетов;
		ВыборкаСтроки = СтатьиБюджета.Выбрать(Родитель, Владелец, , "Код Убыв");
		
		Пока ВыборкаСтроки.Следующий() Цикл
			СписокКодов.Добавить(ВыборкаСтроки.Код);
		КонецЦикла;
		
		Если СписокКодов.Количество() < 2 Тогда
			// На данном уровне имеется только один элемент или группа справочника.
			// Игнорируем действие пользователя.
			
			Возврат;
		КонецЕсли;
		
		ПорядковыйНомер = СписокКодов.Индекс(СписокКодов.НайтиПоЗначению(ТекущийКод));
		
		Если (ПорядковыйНомер = 0) И (Направление < 0) Тогда
			
			// Попытка перемещения первого по порядку элемента вверх.
			ИндексЭлементаЗамены = СписокКодов.Количество() - 1;
			
		ИначеЕсли (ПорядковыйНомер = СписокКодов.Количество() - 1) И (Направление > 0) Тогда
			
			// Попытка перемещения последнего по порядку элемента вниз.
			ИндексЭлементаЗамены = 0;
			
		Иначе
			
			// в иных случаях
			ИндексЭлементаЗамены = ПорядковыйНомер + Направление;
			
		КонецЕсли;
		
		КодЭлементаЗамены = СписокКодов.Получить(ИндексЭлементаЗамены).Значение;
		
		ЭлементЗаменыСсылка = СтатьиБюджета.НайтиПоКоду(КодЭлементаЗамены,,Родитель, Владелец);
		Если ЭлементЗаменыСсылка <> СтатьиБюджета.ПустаяСсылка() Тогда
			
			Попытка
				
				// Открываем транзакцию
				НачатьТранзакцию();
				
				// Промежуточная запись текущего элемента с уникальным кодом
				ЭтотОбъект.Код="&&$##";
				ЭтотОбъект.Записать();
				
				// записываем соседний элемент с кодом текущего
				ЭлементЗамены= ЭлементЗаменыСсылка.ПолучитьОбъект();
				ПредыдущийКод=ЭлементЗамены.Код;
				ЭлементЗамены.Код = ТекущийКод;
				ЭлементЗамены.Записать();
				
				// записываем текущий элемент с кодом соседнего
				ЭтотОбъект.Код = ПредыдущийКод;
				ЭтотОбъект.Записать();
				
				// Завершаем транзакцию
				ЗафиксироватьТранзакцию();
				
			Исключение
				Сообщить("Не удалось записать элемент справочника:
				|" + ОписаниеОшибки());
				
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
	//#КонецЕсли
	
КонецПроцедуры // ИзменитьКод()
Процедура ПередЗаписью(Отказ) 
	//Если ИмяПользователя()<>"AMD_Partner" Тогда	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатьиБюджетовСчета.Счет КАК Счет,
		               |	СтатьиБюджетовСчета.Ссылка КАК Ссылка,
		               |	СтатьиБюджетовСчета.Ссылка.Код КАК Код
		               |ИЗ
		               |	Справочник.СтатьиБюджетов.Счета КАК СтатьиБюджетовСчета
		               |ГДЕ
		               |	СтатьиБюджетовСчета.Ссылка <> &Ссылка
		               |	И СтатьиБюджетовСчета.Ссылка.НеИспользуется = ЛОЖЬ
		               |	И СтатьиБюджетовСчета.Ссылка.Владелец = &Владелец
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СтатьиБюджетовСчета.Ссылка,
		               |	СтатьиБюджетовСчета.Ссылка.Код,
		               |	СтатьиБюджетовСчета.Счет";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Владелец",Владелец);
		
		ТЗсчета = Запрос.Выполнить().Выгрузить();
		
		
		
		Если Не ЭтоГруппа Тогда
			Разделитель = "";
			Сч = "";
			для каждого стр из Счета Цикл
				НайденСчет = ТЗсчета.Найти(стр.Счет,"Счет");
				Если НайденСчет<>Неопределено Тогда
					Сообщить("Счет " + Строка(стр.Счет) +" уже указан в другой статье ("+Строка(НайденСчет.Код)+")"+Строка(НайденСчет.Ссылка));
					Отказ = Истина;
				КонецЕсли;	
				
				Сч = Сч+""+Строка(стр.Счет.КодСправочника)+", ";
			КонецЦикла;	
			СписокСчетов = Сч;
		КонецЕсли;
	//КонецЕсли;
	СписокСтатейCFI = "";
	для каждого стр из НастройкаCFI Цикл
		СписокСтатейCFI = СписокСтатейCFI+""+Строка(СокрЛП(стр.ЭлементСправочника.КодСправочника))+"; ";
	КонецЦикла;	
	
КонецПроцедуры
