
#Область ОбработчикиСобытийФормы
// Код процедур и функций 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций 

&НаКлиенте
Процедура ПолучатьДопИнформациюПриИзменении(Элемент)
	УстановитьВидимость(); 
	ПолучитьДанныеПоТекущейСтроке();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
// Код процедур и функций

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПолучитьДанныеПоТекущейСтроке();	
		
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций  

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ДопИнфо.Видимость = ПолучатьДопИнформацию;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНаСервере(Параметры)
	
	ОбработкаОбмена = Обработки.ОбменSQL.Создать();
	
	возврат ОбработкаОбмена.ПолучитьДанныеОбъекта(Параметры);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеПоТекущейСтроке() 
	
	 Если ПолучатьДопИнформацию Тогда
		ТекСтрока = Элементы.Список.ТекущиеДанные; 
		
		Если ТекСтрока <> Неопределено Тогда
		
			Результат = ПолучитьДанныеНаСервере(Новый Структура("Источник, GUID, База",  ТекСтрока.ТаблицаИсточник, ТекСтрока.ГУИДСправочника, Текстрока.База));
			
			ДопИнфо = "";
			
			Если ТипЗнч(Результат) = Тип("Массив") Тогда 
				
				Для каждого Данные из Результат Цикл
					
					Для каждого ЭлементСтруктуры из Данные Цикл
						
						ДопИнфо = ДопИнфо + ЭлементСтруктуры.Ключ + ": " + ЭлементСтруктуры.Значение + Символы.ПС;
						
					КонецЦикла;
					
				КонецЦикла;
				
			Иначе     
				ДопИнфо = Результат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры




#КонецОбласти