//***********************************************************************************************************
&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Процедура ВыполнитьФоновоеЗадание()
	
	Попытка	
		
	    ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода,, Ключ, Наименование);
		
		Закрыть(ФоновоеЗадание.УникальныйИдентификатор);
		
	Исключение	
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = ОписаниеОшибки();
		
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаданиеИД		 = Параметры.ИдентификаторЗадания;
	ФоновоеЗадание	 = Обработки.КонсольЗаданий.Создать().ПолучитьОбъектФоновогоЗадания(ЗаданиеИД);
	
	Если ФоновоеЗадание <> Неопределено Тогда
		
		Ключ		 = ФоновоеЗадание.Ключ;
		ИмяМетода	 = ФоновоеЗадание.ИмяМетода;
		Наименование = ФоновоеЗадание.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры
//***********************************************************************************************************
&НаКлиенте
Процедура ВыполнитьЗадание(Команда)
	
	ВыполнитьФоновоеЗадание();
	
КонецПроцедуры
//***********************************************************************************************************