

Процедура  ОтправитьВSQLНаСервере() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	авПрочиеПоказателиMDM.Ссылка КАК Ссылка,
	|	авПрочиеПоказателиMDM.Номер КАК Номер,
	|	авПрочиеПоказателиMDM.Организация.Наименование КАК ОрганизацияНаименование
	|ИЗ
	|	Документ.ПрочиеПоказателиMDM КАК авПрочиеПоказателиMDM
	|ГДЕ
	|	НЕ авПрочиеПоказателиMDM.ПометкаУдаления
	|	И авПрочиеПоказателиMDM.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусДокументаПрочиеПоказатели.Утвержден);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Попытка  
			
			ДокОбъект = ВыборкаДетальныеЗаписи.ССылка.ПолучитьОбъект();
			ИнтеграцияДЗО.ЗагрузитьДокументПрочиеПоказателиВ_SQL(ДокОбъект);
			ДокОбъект.Статус = Перечисления.СтатусДокументаПрочиеПоказатели.Отправлен;
			ДокОбъект.Записать();
			ЗаписьЖурналаРегистрации("Загрузка документа Прочие показатели №" + ВыборкаДетальныеЗаписи.Номер +" Организация: " +ВыборкаДетальныеЗаписи.ОрганизацияНаименование,УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ПрочиеПоказателиMDM,
			ВыборкаДетальныеЗаписи.Ссылка, "Выполнено успешно");
		Исключение  
			Ошибка = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Загрузка документа Прочие показатели №" + ВыборкаДетальныеЗаписи.Номер +" Организация: " +ВыборкаДетальныеЗаписи.ОрганизацияНаименование,УровеньЖурналаРегистрации.Ошибка,Метаданные.Документы.ПрочиеПоказателиMDM,
			ВыборкаДетальныеЗаписи.Ссылка, Ошибка);
		КонецПопытки;
		
		
	КонецЦикла;
	
	
КонецПроцедуры
