//**************************************************************************************************
Функция ПолучитьНастройкиFTP(НастройкиОбмена) Экспорт 
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("Порт",							 НастройкиОбмена.Порт);
	Настройки.Вставить("Адрес",							 СокрЛП(НастройкиОбмена.АдресFTP));
	Настройки.Вставить("Логин",							 СокрЛП(НастройкиОбмена.Логин));
	Настройки.Вставить("Пароль",						 СокрЛП(НастройкиОбмена.Пароль));
	Настройки.Вставить("КоличествоПотоков",				 НастройкиОбмена.КоличествоПотоков);
	Настройки.Вставить("КаталогЗагрузкиФайлов",			 СокрЛП(НастройкиОбмена.ПутьККаталогуЗагрузкиФайлов));
	Настройки.Вставить("КаталогХраненияФайловОбмена",	 СокрЛП(НастройкиОбмена.ПутьККаталогуХраненияФайловОбмена));
	
	Возврат Настройки;
	
КонецФункции
//**************************************************************************************************