
//Процедура Печать(ТабДок, Ссылка) Экспорт
//	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
//	Макет = Документы.авОтчетность.ПолучитьМакет("Печать");
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	авОтчетность.Дата1,
//	|	авОтчетность.Дата2,
//	|	авОтчетность.ДатаОтчета,
//	|	авОтчетность.Организация,
//	|	авОтчетность.Ответственный,
//	|	авОтчетность.ДанныеBS.(
//	|		НомерСтроки,
//	|		Code,
//	|		Name,
//	|		Amount
//	|	),
//	|	авОтчетность.ДанныеPL.(
//	|		НомерСтроки,
//	|		Code,
//	|		Name,
//	|		Amount
//	|	),
//	|	авОтчетность.ДанныеCFD.(
//	|		НомерСтроки,
//	|		Code,
//	|		Name,
//	|		Amount
//	|	)
//	|ИЗ
//	|	Документ.авОтчетность КАК авОтчетность
//	|ГДЕ
//	|	авОтчетность.Ссылка В (&Ссылка)";
//	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
//	Выборка = Запрос.Выполнить().Выбрать();

//	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
//	Шапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьДанныеШапка = Макет.ПолучитьОбласть("ДанныеШапка");
//	ОбластьДанные = Макет.ПолучитьОбласть("ДанныеBS");
//	//ОбластьДанныеPLШапка = Макет.ПолучитьОбласть("ДанныеPLШапка");
//	//ОбластьДанныеPL = Макет.ПолучитьОбласть("ДанныеPL");
//	//ОбластьДанныеCFDШапка = Макет.ПолучитьОбласть("ДанныеCFDШапка");
//	//ОбластьДанныеCFD = Макет.ПолучитьОбласть("ДанныеCFD");
//	Подвал = Макет.ПолучитьОбласть("Подвал");

//	ТабДок.Очистить();

//	ВставлятьРазделительСтраниц = Ложь;
//	Пока Выборка.Следующий() Цикл
//		Если ВставлятьРазделительСтраниц Тогда
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;

//		ТабДок.Вывести(ОбластьЗаголовок);

//		Шапка.Параметры.Заполнить(Выборка);
//		ТабДок.Вывести(Шапка, Выборка.Уровень());

//		//ТабДок.Вывести(ОбластьДанныеBSШапка);
//		
//		если ТипОтчета = "BS" тогда
//			ВыборкаДанные = Выборка.ДанныеBS.Выбрать();
//			Пока ВыборкаДанные.Следующий() Цикл
//				ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
//				ТабДок.Вывести(ОбластьДанные, ВыборкаДанные.Уровень());
//			КонецЦикла;
//		КонецЕсли;

//		если ТипОтчета = "PL" тогда
//			ВыборкаДанные = Выборка.ДанныеPL.Выбрать();
//			Пока ВыборкаДанные.Следующий() Цикл
//				ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
//				ТабДок.Вывести(ОбластьДанные, ВыборкаДанные.Уровень());
//			КонецЦикла;
//		КонецЕсли;

//		если ТипОтчета = "CFD" тогда
//			ВыборкаДанные = Выборка.ДанныеCFD.Выбрать();
//			Пока ВыборкаДанные.Следующий() Цикл
//				ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
//				ТабДок.Вывести(ОбластьДанные, ВыборкаДанные.Уровень());
//			КонецЦикла;
//		КонецЕсли;

//		Подвал.Параметры.Заполнить(Выборка);
//		ТабДок.Вывести(Подвал);

//		ВставлятьРазделительСтраниц = Истина;
//	КонецЦикла;
//	//}}
//КонецПроцедуры
