&НаКлиенте
Процедура КомандаОК(Команда)
	Парам = Новый Структура();
	Парам.Вставить("ВидЗаполнения"				,ЭтаФорма.ВидЗаполнения);
	
	Парам.Вставить("ЗаказчикПроекта"			,ЭтаФорма.ЗаказчикПроекта);
	Парам.Вставить("ТипИнвестиции"				,ЭтаФорма.ТипИнвестиции);
	
	Парам.Вставить("ДолговойИнструмент"			,ЭтаФорма.ДолговойИнструмент);
	Парам.Вставить("ТипКредитора"				,ЭтаФорма.ТипКредитора);
	Парам.Вставить("ЦелевоеНазначениеСредств"	,ЭтаФорма.ЦелевоеНазначениеСредств);
	Парам.Вставить("ПроцентнаяСтавка"			,ЭтаФорма.ПроцентнаяСтавка);
	Парам.Вставить("СрокКредитования"			,ЭтаФорма.СрокКредитования);
	
	ЭтаФорма.Закрыть(Парам);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидЗаполнения  = Параметры.ВидЗаполнения;
	если ВидЗаполнения = "Инвест" Тогда
		Элементы.ГруппаИнвест.Видимость = Истина;
		Элементы.ГруппаКредит.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИнвест.Видимость = Ложь;
		Элементы.ГруппаКредит.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПроверитьЭлементыНижнегоУровня(ТекСсылка,ТипСправочника)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ТипСправочника+" КАК Спр
	|ГДЕ
	|	Спр.Родитель = &Родитель";
	запрос.УстановитьПараметр("Родитель",ТекСсылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		Возврат	Истина;
	КонецЕсли;	
	Возврат	Ложь;
	
КонецФункции

&НаКлиенте
Процедура ТипИнвестицииПриИзменении(Элемент)
	Если ПроверитьЭлементыНижнегоУровня(ТипИнвестиции,"авТипПроектаИИнвестиции") Тогда
		Сообщить("У выбранного эталона существуют элементы нижнего уровня. Необходимо выбирать элементы нижнего уровня. Поле очищено");
		ТипИнвестиции = "";
	Конецесли;	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказчикПроектаПриИзменении(Элемент)
	Если ПроверитьЭлементыНижнегоУровня(ЗаказчикПроекта,"авФЦО") Тогда
		Сообщить("У выбранного эталона существуют элементы нижнего уровня. Необходимо выбирать элементы нижнего уровня. Поле очищено");
		ЗаказчикПроекта = "";
	Конецесли;	
КонецПроцедуры

