#Область ПрограммныйИнтерфейс
// Код процедур и функций
Функция Соединение() Экспорт
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	Если НастройкиОбмена.ПарольSQL = "" Тогда
		Сообщить("Нет пароля");
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
		Соединение  = Новый COMОбъект("ADODB.Connection");
		
		//Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + ИнстансSQL + ";" + "UID=" + ЛогинSQL + ";" + "PWD=" + ПарольSQL +";" + "DATABASE=" + БазаДанныхSQL + ";";
		Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + НастройкиОбмена.ИнстансSQL + ";" + "UID=" + НастройкиОбмена.ЛогинSQL + ";" + "PWD=" + НастройкиОбмена.ПарольSQL +";" + "DATABASE=" + НастройкиОбмена.БазаДанныхSQL + ";";
		Соединение.CommandTimeout	 = 600;
        Соединение.ConnectionTimeout = 180;

		Соединение.Open();
		
        Команда.ActiveConnection = Соединение;
		

	Исключение
		
		ЗаписьЖурналаРегистрации("Выборка SQL", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());

		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Команда;
	
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьКоннектор(ПараметрыПодключения) Экспорт

	Коннектор = Обработки.КоннекторСУБД.Создать();
	
	Параметры = Коннектор.СформироватьПараметрыСоединения();
	
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыПодключения);
		
	Коннектор.КонструкторСоединения(Параметры);
	
	возврат Коннектор;  
	
КонецФункции
// Код процедур и функций
#КонецОбласти
