//***********************************************************************************************************
&НаКлиенте
Процедура ОК(Команда)

	Закрыть(Новый Структура("Автообновление, ПериодАвтообновления", Автообновление, ПериодАвтообновления));
	
КонецПроцедуры
//***********************************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автообновление		 = Параметры.Автообновление;
	ПериодАвтообновления = Параметры.ПериодАвтообновления;
	
КонецПроцедуры
//***********************************************************************************************************