
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.   
	Источник = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка; 
	ТипЭталона = ПараметрыВыполненияКоманды.Источник.Объект.ТипЭталона; 
	ЗначениеОтбора = Новый Структура("Документ, ТипЭталона", источник, ТипЭталона);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.СоответствияЭталонов.Форма.ФормаСпискаПоДокументу", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
