  
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		
		СтрокаОсновногоПредставления = Реквизиты.Найти(Владелец.ОсновноеПредставление, "Реквизит"); 
		//++ 15.10.2024 Кибернетика Корыткин Изменение формата сохранения наименования
		Если СтрокаОсновногоПредставления <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаОсновногоПредставления.Значение) = Тип("Число") Тогда			
				
				Наименование = Формат(СтрокаОсновногоПредставления.Значение, "ЧДЦ=0; ЧГ=0");
				
			Иначе
				
				Наименование = СтрокаОсновногоПредставления.Значение;
				
			КонецЕсли;
			
		КонецЕсли;	
		//-- 15.10.2024
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭталонПоУмолчанию Тогда
		
		 Запрос = Новый Запрос;
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЗначенияЭталонов.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЗначенияЭталонов КАК ЗначенияЭталонов
		                |ГДЕ
		                |	ЗначенияЭталонов.ЭталонПоУмолчанию
		                |	И ЗначенияЭталонов.Владелец = &ТипЭталона
		                |	И ЗначенияЭталонов.Ссылка <> &Ссылка";
		 
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("ТипЭталона", Владелец);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не Результат.Пустой() Тогда
			 
			 Сообщить("Для данного типа эталонных справочников уже задан элемент, который используется по умолчанию");
			 Отказ = Истина;
			 
		 КонецЕсли;
		
	 КонецЕсли;	 
	 
	 Если РодительПоУмолчанию Тогда
		
		 Запрос = Новый Запрос;
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЗначенияЭталонов.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЗначенияЭталонов КАК ЗначенияЭталонов
		                |ГДЕ
		                |	ЗначенияЭталонов.РодительПоУмолчанию
		                |	И ЗначенияЭталонов.Владелец = &ТипЭталона
		                |	И ЗначенияЭталонов.Ссылка <> &Ссылка";
		 
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("ТипЭталона", Владелец);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не Результат.Пустой() Тогда
			 
			 Сообщить("Для данного типа эталонных справочников уже задан элемент, который используется по умолчанию");
			 Отказ = Истина;
			 
		 КонецЕсли;
		
	КонецЕсли;	


		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	ИнфоОбУдалении = РегистрыСведений.УдаленныеЭталоны.СоздатьМенеджерЗаписи();
	ИнфоОбУдалении.ГУИД = Ссылка.УникальныйИдентификатор(); 
	ИнфоОбУдалении.ТипЭталона = Ссылка.Владелец;
	ИнфоОбУдалении.Записать();  
	
КонецПроцедуры

#КонецОбласти

